[{"id":"4726e50a-0a2d-48b5-af62-d4d260b3407f","title":"Como faço para acessar minha conta (Login)?","content":"<p class=\"my-4\">Você pode acessar sua conta de duas maneiras:</p><ol><li><p class=\"my-4\"><strong>Com E-mail e Senha:</strong> Na página de Login, insira o e-mail e a senha que você usou no cadastro e clique em <strong>Entrar</strong>.</p></li><li><p class=\"my-4\"><strong>Com o Google:</strong> Para um acesso rápido e sem senha, clique no botão <strong>Entrar com o Google</strong>. Se você se cadastrou usando sua conta do Google, o login será automático.</p></li></ol><p class=\"my-4\"><br></p>","category":"Acesso e Cadastro","user_type":"ambos"}, 
 {"id":"68983c56-1038-4490-8f31-aa6fadb953c6","title":"Como me cadastro na plataforma?","content":"<p class=\"my-4\">Para criar sua conta, acesse nossa página de <strong>Cadastro</strong> e escolha o tipo de perfil que melhor se adequa a você: <strong>Professor</strong> ou <strong>Aluno</strong>.</p><p class=\"my-4\">Você terá duas opções para se cadastrar:</p><ol><li><p class=\"my-4\"><strong>Cadastro com Google (Recomendado):</strong></p><ul><li><p class=\"my-4\">Clique em \"Cadastrar com Google\" para um processo rápido e seguro.</p></li><li><p class=\"my-4\">Usaremos as informações da sua conta Google (nome e email) para criar seu perfil, sem a necessidade de criar uma nova senha para nosso site.</p></li></ul></li><li><p class=\"my-4\"><strong>Cadastro com Email e Senha:</strong></p><ul><li><p class=\"my-4\">Preencha os campos com seu nome completo, email e crie uma senha segura.</p></li></ul></li></ol><p class=\"my-4\">Em ambos os casos, é importante que você leia e aceite nossos <strong>Termos de Uso</strong> e <strong>Política de Privacidade</strong> para finalizar o cadastro.</p><p class=\"my-4\"><br></p>","category":"Acesso e Cadastro","user_type":"ambos"}, 
 {"id":"d8616c48-7af4-49dc-a91c-23ab6b6521e0","title":"Esqueci minha senha, o que eu faço?","content":"<p class=\"my-4\">Se você esqueceu sua senha, não se preocupe. Na página de Login, clique no link <strong>Esqueci minha senha</strong>. Você será direcionado para uma página onde poderá inserir seu e-mail de cadastro. Ao confirmar, enviaremos um link com as instruções para você criar uma nova senha. O link te levará para a página de redefinição de senha.</p>","category":"Acesso e Cadastro","user_type":"ambos"}, 
 {"id":"ff340d2b-486d-44ee-bba4-ba26b6bb32bd","title":"Pedi para redefinir a senha, mas não recebi o e-mail. O que fazer?","content":"<p class=\"my-4\">Após solicitar a redefinição, nosso sistema envia um e-mail para o endereço informado. Se você não o recebeu em alguns minutos, siga estes passos:<br></p><p class=\"my-4\"><strong>Verifique sua caixa de Spam ou Lixo Eletrônico.</strong>&nbsp; Às vezes, e-mails automáticos são filtrados.<br><br><strong>Confirme se o e-mail digitado está correto</strong>. Se houver um erro de digitação, você não receberá o link.</p><p class=\"my-4\"><strong>Aguarde o temporizador</strong>. Por segurança, a plataforma permite uma nova tentativa de envio somente após 60 segundos.</p>","category":"Acesso e Cadastro","user_type":"ambos"}, 
 {"id":"d69339b6-e19d-450f-a07c-4528844b1022","title":"O link para redefinir a senha expirou ou é inválido.","content":"<p class=\"my-4\">Por motivos de segurança, o link para redefinição de senha tem um tempo de validade e só pode ser usado uma vez. Se você está vendo uma mensagem de <strong>link inválido ou expirado</strong>, significa que o prazo para uso do link acabou. Por favor, retorne à tela de <strong>Esqueci minha senha</strong>&nbsp;e solicite um novo link.</p>","category":"Acesso e Cadastro","user_type":"ambos"}, 
 {"id":"bf6b7be7-5746-4142-a0b2-a7a2222adc3d","title":"O que acontece depois que eu me cadastro?","content":"Após preencher o formulário de cadastro, enviaremos um e-mail de confirmação para o endereço que você informou. Você precisa clicar no link dentro deste e-mail para verificar sua conta. Somente após a verificação você poderá fazer login na plataforma.","category":"Acesso e Cadastro","user_type":"ambos"}, 
 {"id":"07400bad-81eb-45d1-8564-2e661f75509a","title":"Posso mudar meu tipo de conta depois do cadastro?","content":"Atualmente, não é possível alterar o tipo de conta (de Aluno para Professor ou vice-versa) após o cadastro. Se você escolheu o tipo errado, a solução é excluir sua conta atual nas configurações de perfil e criar uma nova com o tipo correto.","category":"Acesso e Cadastro","user_type":"ambos"}, 
 {"id":"3c003e16-b6c6-4135-b847-842282769ba4","title":"Posso ter uma conta de Aluno e uma de Professor?","content":"<p>Sim, mas você precisará usar<strong> e-mails diferentes </strong>para cada conta. A plataforma trata cada e-mail como um usuário único. Você pode ter uma conta de Professor com um e-mail e uma conta de Aluno com outro e-mail.</p>","category":"Acesso e Cadastro","user_type":"ambos"}, 
 {"id":"12f1b41c-7ad6-418e-b4cd-2ea1479d0e99","title":"Qual a diferença entre a conta de Professor e a de Aluno?","content":"<p>A escolha do tipo de conta define como você usará a plataforma:</p><p><br></p><p><strong>Conta de Professor:</strong></p><p>Feita para profissionais que desejam gerenciar seus alunos, criar rotinas de treino personalizadas e acompanhar o progresso de cada um.</p><p><br></p><p><strong>Conta de Aluno:</strong></p><p>Feita para quem quer receber os treinos de seu professor, registrar suas execuções, acompanhar a própria evolução e se comunicar com o profissional.</p>","category":"Acesso e Cadastro","user_type":"ambos"}, 
 {"id":"472a5689-4ca3-4c92-9750-13fe31dfd170","title":"Recebi uma mensagem de Credenciais inválidas.","content":"<p class=\"my-4\">Este erro ocorre quando o e-mail ou a senha digitados não correspondem aos registros em nosso sistema. Verifique se não há erros de digitação. Se o problema persistir e você tiver certeza do e-mail, recomendamos usar a função <strong>Esqueci minha senha</strong>&nbsp;para redefinir seu acesso.</p>","category":"Acesso e Cadastro","user_type":"ambos"}, 
 {"id":"75d83acc-eb5d-418a-a682-fb19a7f478f7","title":"Recebi uma mensagem de \"Email não confirmado\". O que fazer?","content":"Esta mensagem significa que sua conta foi criada, mas o e-mail ainda não foi verificado. Por favor, procure em sua caixa de entrada (e na pasta de spam) pelo nosso e-mail de confirmação e clique no link para ativar sua conta. Se não encontrar, você pode solicitar um novo envio na própria tela de login.","category":"Acesso e Cadastro","user_type":"ambos"}, 
 {"id":"cad1230a-6698-4f9e-ab2d-910fefe15d10","title":"O que é o processo de Configuração inicial (Onboarding)?","content":"<p class=\"my-4\">O Onboarding é um guia rápido de configuração inicial do seu perfil. Ele nos ajuda a coletar as informações essenciais para que você tenha a melhor experiência na plataforma. Tanto para Alunos quanto para Professores, apenas a primeira etapa com os dados básicos é obrigatória.</p>","category":"Configuração Inicial","user_type":"ambos"}, 
 {"id":"ad98ffa5-fc2a-4048-8aab-d3f4225e20e7","title":"Posso editar minhas informações profissionais depois?","content":"Sim. Todas as informações do seu perfil, como CREF, biografia, especializações e redes sociais, podem ser adicionadas ou editadas a qualquer momento. Basta acessar a seção \"Meu Perfil\" no menu principal.","category":"Configuração Inicial","user_type":"professor"}, 
 {"id":"0de15fe1-8f6a-4f0a-bf17-d8494c327a98","title":"Preciso preencher todos os meus dados no primeiro acesso?","content":"Não. Apenas seus dados básicos (nome, gênero e data de nascimento) são obrigatórios para começar. Após preenchê-los, perguntaremos se você deseja continuar para o Questionário de Saúde (PAR-Q). Você pode respondê-lo na hora ou pular e ir direto para a tela inicial do aplicativo.","category":"Configuração Inicial","user_type":"aluno"}, 
 {"id":"16a0095e-d90f-4380-ab8c-cae6bbc2c1c5","title":"Preciso preencher minhas informações profissionais e redes sociais no primeiro acesso?","content":"Não. Apenas seus dados básicos (nome, gênero e data de nascimento) são obrigatórios. Após essa etapa, perguntaremos se você deseja continuar para adicionar suas informações profissionais. Você pode pular e ir direto para a tela inicial, mas recomendamos que preencha assim que possível para ter um perfil completo.","category":"Configuração Inicial","user_type":"professor"}, 
 {"id":"755bf018-3424-42ca-b1c3-a9e1a56a8095","title":"O que é o Questionário de Saúde (PAR-Q)?","content":"O PAR-Q (Questionário de Prontidão para Atividade Física) é um conjunto de 7 perguntas simples sobre sua saúde. Respondê-lo ajuda seu professor a entender melhor sua condição física e a criar um plano de treino mais seguro e eficaz para você. Recomendamos fortemente que você o preencha.","category":"Configuração Inicial","user_type":"aluno"}, 
 {"id":"0d75ddc7-2d46-4dd9-a195-7d544d473a22","title":"Por que devo preencher minhas informações profissionais?","content":"Preencher suas informações profissionais (CREF, anos de experiência, especializações, biografia) e redes sociais é fundamental para construir sua marca. Alunos podem encontrar seu perfil na nossa página de busca de professores. Um perfil completo e bem detalhado é seu principal cartão de visitas para atrair e conquistar novos clientes através do Titans Fitness.","category":"Configuração Inicial","user_type":"professor"}, 
 {"id":"e4745e6a-b7e3-4a1d-8f67-019a0e6e18a4","title":"Posso responder o Questionário de Saúde (PAR-Q) depois?","content":"<p class=\"my-4\">Sim. Se você optar por pular o questionário durante a configuração inicial, poderá acessá-lo e preenchê-lo a qualquer momento na seção <strong>Meu Perfil</strong>, na aba <strong>Saúde</strong>.</p>","category":"Configuração Inicial","user_type":"aluno"}, 
 {"id":"cab6bac8-7d8f-4cca-821c-9bbc70b8587f","title":"Por onde começo? Primeiros passos para professores","content":"<p class=\"my-4\">Bem-vindo ao Titans! Aqui está um guia rápido para você começar a usar a plataforma:</p><p class=\"my-4\"><strong>1. Complete seu perfil</strong></p><p class=\"my-4\">Após o cadastro, preencha suas informações profissionais e adicione suas redes sociais. Isso ajuda seus alunos a conhecerem melhor você.</p><p class=\"my-4\"><strong>2. Adicione seus alunos</strong></p><p class=\"my-4\">Na página <strong>Alunos</strong>, você pode convidar novos alunos por email, QR Code ou vincular alunos que já possuem conta. Seus alunos precisam estar cadastrados para receberem rotinas.</p><p class=\"my-4\"><strong>3. Crie sua primeira rotina de treino</strong></p><p class=\"my-4\">Acesse <strong>Rotinas</strong> no menu principal e crie uma rotina personalizada para seu aluno. Defina os treinos, exercícios, séries e intervalos.</p><p class=\"my-4\"><strong>4. Acompanhe o progresso</strong></p><p class=\"my-4\">Quando seu aluno executar os treinos, você poderá ver o histórico de execução e acompanhar a evolução dele.</p><p class=\"my-4\"><strong>Dica:</strong> Use a Central de Ajuda sempre que tiver dúvidas. Estamos aqui para ajudar!</p>","category":"Configuração Inicial","user_type":"professor"}, 
 {"id":"60943843-f90d-42c0-b83f-e302dea997e4","title":"Como faço para instalar o aplicativo no meu celular?","content":"<p class=\"my-4\">Você pode adicionar o Titans Fitness ao seu celular para ter acesso rápido, como um aplicativo nativo.</p><p class=\"my-4\"><span style=\"color: rgb(97, 97, 97);\"> </span></p><p class=\"my-4\"><strong>Passo a passo:</strong></p><ol><li><p class=\"my-4\">Acesse nosso site pelo navegador do seu celular (Chrome, Safari, etc.)</p></li><li><p class=\"my-4\">Você verá um botão \"Instalar App\"</p></li><li><p class=\"my-4\">O navegador irá solicitar a confirmação de instalação</p></li><li><p class=\"my-4\">Aparecerá uma mensagem por 10 segundos pedindo para você esperar enquanto preparamos os recursos necessários para o aplicativo funcionar offline</p></li><li><p class=\"my-4\">O tempo de espera varia dependendo da sua conexão,&nbsp;<strong>pode levar mais que 10 segundos</strong></p></li><li><p class=\"my-4\">O ícone do aplicativo aparecerá na lista de aplicativos do seu celular (provavelmente será o último da lista)</p></li><li><p class=\"my-4\"><strong>Ele não será instalado na tela inicial</strong>, mas você poderá movê-lo para a tela inicial manualmente se desejar</p></li></ol><p class=\"my-4\"></p>","category":"Funcionalidades do Aplicativo","user_type":"ambos"}, 
 {"id":"708f8a48-2ce0-4320-b0f1-fda2dfa909f4","title":"Como funciona a atualização do aplicativo?","content":"<p class=\"my-4\">Estamos sempre melhorando a plataforma. Quando uma nova versão estiver disponível, você verá um aviso no aplicativo com um botão \"Atualizar\". Basta clicar nele para carregar a versão mais recente com todas as novidades e correções.</p>","category":"Funcionalidades do Aplicativo","user_type":"ambos"}, 
 {"id":"7c610a82-7efe-4bbe-a419-d1370d49ad9a","title":"Como funciona o sistema de mensagens?","content":"Nosso sistema de mensagens permite que você se comunique diretamente com seus professores ou alunos. As mensagens são entregues em tempo real. Quando você recebe uma nova mensagem e não está com o aplicativo aberto, enviamos uma notificação para o seu dispositivo para mantê-lo informado.","category":"Funcionalidades do Aplicativo","user_type":"ambos"}, 
 {"id":"313c3115-b886-4faa-91a9-1f2333c668bd","title":"Posso usar o aplicativo sem conexão com a internet?","content":"Sim. O Titans Fitness foi projetado para funcionar offline. Você pode acessar e registrar a execução dos seus treinos mesmo em locais com conexão ruim ou inexistente. Assim que você se conectar à internet novamente, seus dados de progresso serão sincronizados automaticamente.","category":"Funcionalidades do Aplicativo","user_type":"ambos"}, 
 {"id":"5c8e8d1d-aebb-455f-9677-3b5c4d381eb6","title":"O que são Alertas de Mensagem?","content":"<p class=\"my-4\">Os alertas são <strong>avisos que aparecem no seu dispositivo</strong> (celular, tablet ou computador) mesmo quando o aplicativo Titans Fitness está fechado ou você está usando outro aplicativo.</p><p class=\"my-4\"><span style=\"color: rgb(97, 97, 97);\"> </span></p><p class=\"my-4\"><strong>Como funcionam:</strong></p><ul><li><p class=\"my-4\">Quando você recebe uma nova mensagem, um aviso aparece na tela do seu dispositivo</p></li><li><p class=\"my-4\">Você pode ver a notificação na barra de notificações do seu celular</p></li><li><p class=\"my-4\">Funciona mesmo com o navegador fechado (após instalar o app)</p></li><li><p class=\"my-4\">Você ouve um som ou vibração (conforme configurações do seu dispositivo)</p></li></ul><h3></h3><p class=\"my-4\"></p>","category":"Mensagens e Notificações","user_type":"ambos"}, 
 {"id":"e069810c-2cf2-4839-8848-17ddac10f9de","title":"Como ativo os Alertas de Mensagem?","content":"<p class=\"my-4\">Você tem dois caminhos para ativar os alertas de mensagem:</p><ol><li><p class=\"my-4\"><strong>Via Configurações:</strong></p><ul><li><p class=\"my-4\">Acesse <strong>Configurações</strong> no menu do aplicativo</p></li><li><p class=\"my-4\">Na seção \"Alertas\", ative o botão \"Alertas Push\"</p></li><li><p class=\"my-4\">Permita as notificações quando o navegador solicitar</p></li><li><p class=\"my-4\">Aguarde o carregamento - pode levar alguns segundos</p></li></ul></li><li><p class=\"my-4\"><strong>Via Chat de Mensagens:</strong></p><ul><li><p class=\"my-4\">Ao acessar as mensagens, você verá um banner amarelo solicitando ativação dos alertas</p></li><li><p class=\"my-4\">Clique no botão \"Ativar agora\"</p></li><li><p class=\"my-4\">Permita as notificações quando o navegador solicitar</p></li><li><p class=\"my-4\">Aguarde o carregamento, pode levar alguns segundos</p></li></ul></li></ol><p class=\"my-4\"><strong>Importante:</strong></p><ul><li><p class=\"my-4\">Você pode desativar os alertas a qualquer momento nas Configurações</p></li></ul><p class=\"my-4\"><br></p>","category":"Mensagens e Notificações","user_type":"ambos"}, 
 {"id":"8e92e754-9ab0-49d5-824f-071635211e84","title":"O que são as Mensagens do Sistema?","content":"<p class=\"my-4\">A conversa <strong>Mensagens do Sistema&nbsp;</strong>é o seu canal oficial de notificações do sistema. Usamos este chat para enviar avisos importantes, como a confirmação de um novo vínculo com um professor/aluno, alertas sobre inatividade da sua conta ou o cancelamento de uma rotina. Não é possível responder a estas mensagens.</p>","category":"Mensagens e Notificações","user_type":"ambos"}, 
 {"id":"63a10169-0db2-4bb5-927f-7c4ddb436695","title":"Como inicio uma conversa?","content":"Para iniciar uma conversa, abra o painel de Mensagens. Você verá uma lista com todos os seus contatos (alunos que te seguem ou professores que você segue). Basta clicar no nome do contato com quem deseja falar. Se uma conversa ainda não existir, ela será criada automaticamente.","category":"Mensagens e Notificações","user_type":"ambos"}, 
 {"id":"80c27384-5165-475b-8d71-5989a56fedb9","title":"Como sei que tenho novas mensagens?","content":"O ícone de Mensagens exibirá um contador vermelho com o número total de mensagens não lidas. Dentro do painel, cada conversa com novas mensagens também terá seu próprio contador.","category":"Mensagens e Notificações","user_type":"ambos"}, 
 {"id":"120e5553-43b1-4642-a4cb-e1cfef34ecfd","title":"Como crio um grupo de mensagens?","content":"<p class=\"my-4\">No painel de Mensagens, na parte superior,&nbsp; clique no ícone&nbsp;<img class=\"inline-block h-[1.2em] w-auto -translate-y-px\" src=\"data:image/svg+xml,%3Csvg%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%20width%3D%2232%22%20height%3D%2232%22%20viewBox%3D%220%200%2032%2032%22%3E%3Ccircle%20cx%3D%2216%22%20cy%3D%2216%22%20r%3D%2216%22%20fill%3D%22%23f3f4f6%22%2F%3E%3Cg%20transform%3D%22translate(4%2C%204)%22%20stroke%3D%22currentColor%22%20stroke-width%3D%222%22%20stroke-linecap%3D%22round%22%20stroke-linejoin%3D%22round%22%20fill%3D%22none%22%3E%3Cpath%20d%3D%22M16%2021v-2a4%204%200%200%200-4-4H6a4%204%200%200%200-4%204v2%22%2F%3E%3Ccircle%20cx%3D%229%22%20cy%3D%227%22%20r%3D%224%22%2F%3E%3Cpath%20d%3D%22M22%2021v-2a4%204%200%200%200-3-3.87%22%2F%3E%3Cpath%20d%3D%22M16%203.13a4%204%200%200%201%200%207.75%22%2F%3E%3C%2Fg%3E%3C%2Fsvg%3E\" alt=\"Ícone de Grupo\"><strong>&nbsp;</strong>para criar um novo grupo. Você poderá dar um nome ao grupo e selecionar quais dos seus alunos farão parte dele. Apenas professores podem criar grupos.</p>","category":"Mensagens e Notificações","user_type":"professor"}, 
 {"id":"81670381-1b8c-43f8-ae45-498c7e502b4b","title":"Posso adicionar ou remover participantes de um grupo?","content":"<p class=\"my-4\">Sim. Se você é o criador do grupo, pode acessar as <strong>Informações do Grupo</strong>&nbsp;clicando no ícone de configurações dentro da conversa. Lá, você terá as opções para adicionar novos alunos ou remover participantes existentes.</p>","category":"Mensagens e Notificações","user_type":"professor"}, 
 {"id":"5bc9fecd-1ab9-459c-bb1a-62f2ce5a73d0","title":"Posso apagar uma mensagem que enviei?","content":"<p class=\"my-4\">Sim! Você pode apagar mensagens que você enviou. Para isso:</p><ol><li><p class=\"my-4\">Clique no ícone&nbsp;<img class=\"inline-block h-[1.2em] w-auto -translate-y-px\" src=\"data:image/svg+xml,%3Csvg%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%20width%3D%2232%22%20height%3D%2232%22%20viewBox%3D%220%200%2032%2032%22%3E%3Ccircle%20cx%3D%2216%22%20cy%3D%2216%22%20r%3D%2216%22%20fill%3D%22%23f3f4f6%22%2F%3E%3Cg%20transform%3D%22translate(4%2C%204)%22%20stroke%3D%22currentColor%22%20stroke-width%3D%222%22%20stroke-linecap%3D%22round%22%20stroke-linejoin%3D%22round%22%20fill%3D%22none%22%3E%3Cpath%20d%3D%22M3%206h18%22%2F%3E%3Cpath%20d%3D%22M19%206v14a2%202%200%200%201-2%202H7a2%202%200%200%201-2-2V6m3%200V4a2%202%200%200%201%202-2h4a2%202%200%200%201%202%202v2%22%2F%3E%3Cline%20x1%3D%2210%22%20x2%3D%2210%22%20y1%3D%2211%22%20y2%3D%2217%22%2F%3E%3Cline%20x1%3D%2214%22%20x2%3D%2214%22%20y1%3D%2211%22%20y2%3D%2217%22%2F%3E%3C%2Fg%3E%3C%2Fsvg%3E\" alt=\"Ícone de Lixeira\">&nbsp;ao lado da mensagem que deseja apagar</p></li><li><p class=\"my-4\">Confirme a exclusão</p></li></ol><p class=\"my-4\"><strong>Importante:</strong></p><ul><li><p class=\"my-4\">Você só pode apagar mensagens que <strong>você mesmo enviou</strong></p></li><li><p class=\"my-4\">A mensagem será removida definitivamente da conversa</p></li><li><p class=\"my-4\">Os outros participantes da conversa <strong>não verão mais</strong> a mensagem apagada</p></li></ul><p class=\"my-4\"></p>","category":"Mensagens e Notificações","user_type":"ambos"}, 
 {"id":"870a95c3-5b51-4468-bf18-8ebbdd91c531","title":"Posso enviar imagens ou arquivos no chat?","content":"Atualmente, o sistema de chat suporta apenas mensagens de texto e emojis. A funcionalidade de envio de mídias, como fotos e vídeos, está em nosso planejamento para futuras atualizações.","category":"Mensagens e Notificações","user_type":"ambos"}, 
 {"id":"9a246ad0-fab6-43da-bcaf-2170739595b2","title":"Como acesso e edito meu perfil?","content":"<p class=\"my-4\">Para acessar e gerenciar suas informações, o caminho é um pouco diferente dependendo do dispositivo que você está usando:</p><ul><li><p class=\"my-4\"><strong>No computador (Desktop):</strong> Clique no seu avatar, localizado na <strong>parte inferior da barra de navegação lateral</strong>, e selecione a opção <strong>Meu Perfil</strong>.</p></li><li><p class=\"my-4\"><strong>No celular (Mobile):</strong> Clique no seu avatar, localizado no <strong>canto direito do cabeçalho superior</strong>, e selecione <strong>Meu Perfil</strong>.</p></li></ul><p class=\"my-4\">Sua página de perfil é o local central para todas as suas informações pessoais e de conta. Ela é organizada em abas para facilitar a navegação:</p><ul><li><p class=\"my-4\"><strong>Se você é Professor:</strong> encontrará as abas <strong>Pessoal</strong>, <strong>Profissional</strong>, <strong>Redes Sociais</strong>, <strong>Segurança</strong> e <strong>Conta</strong>.</p></li><li><p class=\"my-4\"><strong>Se você é Aluno:</strong> encontrará as abas <strong>Informações Básicas</strong>, <strong>Informações Físicas</strong>, <strong>Saúde (PAR-Q)</strong>, <strong>Segurança</strong> e <strong>Conta</strong>.</p></li></ul><p class=\"my-4\">Cada aba contém um formulário onde você pode visualizar e atualizar suas informações. Manter seu perfil atualizado garante a melhor experiência na plataforma.</p>","category":"Meu Perfil","user_type":"ambos"}, 
 {"id":"f3ec3264-f8f9-4108-a626-c3890e44f219","title":"Como altero minha foto de perfil (avatar)?","content":"<p class=\"my-4\">Sua foto de perfil é uma parte importante da sua identidade na plataforma. Você pode personalizá-la usando uma foto ou, se preferir, manter um avatar com sua inicial e uma cor gerada automaticamente.</p><p class=\"my-4\">Siga os passos abaixo para gerenciar sua foto:</p><ol><li><p class=\"my-4\"><strong>Acesse seu perfil:</strong> Vá para a página <strong>Meu Perfil</strong> através do menu do seu avatar.</p></li><li><p class=\"my-4\"><strong>Abra o editor:</strong> Clique diretamente sobre a sua foto de perfil (ou sobre o avatar de letra). Isso abrirá a janela de edição.</p></li><li><p class=\"my-4\"><strong>Para adicionar ou alterar uma foto:</strong></p><ul><li><p class=\"my-4\">Clique no botão <strong>Selecionar Imagem</strong> e escolha um arquivo do seu computador ou celular.</p></li><li><p class=\"my-4\">Uma ferramenta de ajuste aparecerá sobre a imagem. Use o <strong>controle deslizante de zoom</strong> para aproximar ou afastar e <strong>clique e arraste a imagem</strong> para posicionar o melhor enquadramento dentro do círculo.</p></li><li><p class=\"my-4\">Quando estiver satisfeito, clique em <strong>Salvar Foto</strong>.</p></li></ul></li><li><p class=\"my-4\"><strong>Para remover sua foto:</strong></p><ul><li><p class=\"my-4\">Dentro da janela de edição, clique no botão <strong>Remover Foto</strong>.</p></li><li><p class=\"my-4\">Isso removerá sua imagem atual e reativará o avatar de letra padrão.</p></li></ul></li></ol><p class=\"my-4\"><strong>Como funciona o avatar de letra?</strong></p><p class=\"my-4\">Se você não tiver uma foto de perfil, a plataforma cria automaticamente um avatar para você. A <strong>letra</strong> é a inicial do seu nome cadastrado e a <strong>cor de fundo</strong> é selecionada aleatoriamente para dar um toque de personalização. Você poderá alterar a cor.</p>","category":"Meu Perfil","user_type":"ambos"}, 
 {"id":"0399a7e6-24e3-4730-b23f-08d7c9aaba5e","title":"Como edito minhas informações pessoais?","content":"<p class=\"my-4\">Na aba <strong>Pessoal</strong>, você pode atualizar seu nome completo, telefone (com máscara automática de DDD), data de nascimento (usando um seletor de calendário) e gênero. As opções de gênero são: Masculino, Feminino, Outro e Prefiro não informar. Após fazer as alterações, clique em <strong>Salvar Alterações</strong>.</p>","category":"Meu Perfil","user_type":"professor"}, 
 {"id":"ecd93927-988e-4be4-966a-5aa786ce7fd2","title":"O que posso editar no meu perfil de aluno?","content":"<p class=\"my-4\">Sua página de <strong>Meu Perfil</strong> é o seu espaço para gerenciar suas informações pessoais, de saúde e físicas. Manter esses dados atualizados é fundamental para que seu professor possa criar os treinos mais seguros e eficazes para você.</p><p class=\"my-4\">A página é organizada nas seguintes abas:</p><p class=\"my-4\"><strong>1. Informações Básicas</strong></p><p class=\"my-4\">Nesta aba, você pode atualizar seus dados pessoais.</p><ul><li><p class=\"my-4\"><strong>Nome Completo:</strong> Seu nome como será exibido na plataforma.</p></li><li><p class=\"my-4\"><strong>Gênero e Data de Nascimento:</strong> Informações que ajudam a personalizar sua experiência.</p></li><li><p class=\"my-4\"><strong>Descrição Pessoal:</strong> Um espaço para você contar um pouco sobre seus objetivos, experiência com exercícios ou qualquer outra informação que queira compartilhar com seu professor.</p></li></ul><p class=\"my-4\"><strong>2. Informações Físicas</strong></p><p class=\"my-4\">Aqui você pode registrar e atualizar suas medidas corporais mais recentes.</p><ul><li><p class=\"my-4\"><strong>Peso (kg):</strong> Seu peso atual.</p></li><li><p class=\"my-4\"><strong>Altura (cm):</strong> Sua altura.</p></li></ul><p class=\"my-4\">Manter o peso e a altura atualizados é importante para que o cálculo do seu IMC (Índice de Massa Corporal) esteja sempre correto nas avaliações físicas.</p><p class=\"my-4\"><strong>3. Saúde (PAR-Q)</strong></p><p class=\"my-4\">O PAR-Q (Questionário de Prontidão para Atividade Física) é uma ferramenta de segurança essencial.</p><ul><li><p class=\"my-4\"><strong>O que é?</strong> Um conjunto de perguntas simples sobre sua saúde para identificar se você precisa de uma avaliação médica antes de iniciar ou intensificar um programa de exercícios.</p></li><li><p class=\"my-4\"><strong>Por que é importante?</strong> Suas respostas ajudam seu professor a entender suas condições de saúde e a criar um plano de treino seguro e adequado para você.</p></li><li><p class=\"my-4\"><strong>Posso alterar?</strong> Uma vez preenchido no processo de cadastro inicial ou aqui em Meu Perfil o questionário <strong>não pode ser alterado</strong>. Essas informações servirão como uma 'foto' do seu estado inicial serão consultadas pelo seu professor na criação de sua primeira rotina de treino.</p></li></ul><p class=\"my-4\">Manter seu perfil completo e atualizado é o primeiro passo para uma jornada de treinos segura e com ótimos resultados!</p>","category":"Meu Perfil","user_type":"aluno"}, 
 {"id":"797827c9-217b-499e-87c6-02afe75bed4e","title":"Como edito minhas informações profissionais?","content":"<p class=\"my-4\">Na aba <strong>Profissional</strong>, você pode preencher ou atualizar seu CREF, anos de experiência e sua biografia.<br><br><strong>Anos de Experiência:</strong>&nbsp;As opções são: Menos de 1 ano, 1-2 anos, 3-5 anos, 6-10 anos e Mais de 10 anos.<br><br><strong>Especializações:</strong>&nbsp;Para adicionar, selecione uma opção da lista (ex: Musculação, Funcional, Emagrecimento, etc.). A especialização aparecerá como uma etiqueta. Para remover, basta clicar no \"X\" ao lado do nome da especialização.</p>","category":"Meu Perfil","user_type":"professor"}, 
 {"id":"4564e28e-ada2-4741-9f06-c936195a50fa","title":"Como adiciono minhas redes sociais?","content":"<p class=\"my-4\">Na aba \"Redes Sociais\", você pode adicionar os links para os seguintes perfis:<br><br><strong>Instagram (ex: @seuinstagram)</strong></p><p class=\"my-4\"><strong>&nbsp;Facebook (ex: facebook.com/seuperfil)</strong></p><p class=\"my-4\"><strong>LinkedIn (ex: linkedin.com/in/seuperfil)</strong></p><p class=\"my-4\"><strong>Website pessoal (ex: https://seusite.com)</strong></p><p class=\"my-4\">Essas informações serão exibidas em seu perfil público para atrair novos alunos.</p>","category":"Meu Perfil","user_type":"professor"}, 
 {"id":"00bdbf88-04ad-487d-b5b7-6ce0a1824b1b","title":"Como altero minha senha?","content":"<p class=\"my-4\">Manter sua senha atualizada é uma ótima prática de segurança. Para alterar sua senha na plataforma, siga estes passos simples:</p><ol><li><p class=\"my-4\"><strong>Acesse seu Perfil:</strong></p><ul><li><p class=\"my-4\"><strong>No computador:</strong> Clique no seu avatar, localizado na parte inferior da barra de navegação lateral, e selecione <strong>Meu Perfil</strong>.</p></li><li><p class=\"my-4\"><strong>No celular:</strong> Clique no seu avatar, localizado no canto direito do cabeçalho, e selecione <strong>Meu Perfil</strong>.</p></li></ul></li><li><p class=\"my-4\"><strong>Vá para a aba Segurança:</strong> Dentro da sua página de perfil, clique na aba chamada <strong>Segurança</strong>.</p></li><li><p class=\"my-4\"><strong>Altere sua Senha:</strong></p><ul><li><p class=\"my-4\">Você encontrará uma seção para alteração de senha.</p></li><li><p class=\"my-4\">Digite sua <strong>senha atual</strong> para verificação.</p></li><li><p class=\"my-4\">Em seguida, digite sua <strong>nova senha</strong> e confirme-a no campo seguinte para garantir que não haja erros de digitação.</p></li><li><p class=\"my-4\">Clique no botão <strong>Salvar Alterações</strong> ou <strong>Alterar Senha</strong>.</p></li></ul></li></ol><p class=\"my-4\">Pronto! Sua senha foi atualizada. Na próxima vez que você fizer login, lembre-se de usar a nova senha.</p>","category":"Meu Perfil","user_type":"ambos"}, 
 {"id":"b0c9c95f-012f-4b24-9cdf-63e3cabc8961","title":"Como cancelo minha conta?","content":"<p class=\"my-4\">Lamentamos que você esteja pensando em nos deixar. O encerramento da sua conta é uma ação <strong>permanente e irreversível</strong>. Todos os seus dados, incluindo rotinas, avaliações, histórico e mensagens, serão excluídos definitivamente.</p><p class=\"my-4\">Se você tem certeza de que deseja prosseguir, siga os passos abaixo:</p><ol><li><p class=\"my-4\"><strong>Acesse seu Perfil:</strong></p><ul><li><p class=\"my-4\"><strong>No computador:</strong> Clique no seu avatar, localizado na parte inferior da barra de navegação lateral, e selecione <strong>Meu Perfil</strong>.</p></li><li><p class=\"my-4\"><strong>No celular:</strong> Clique no seu avatar, localizado no canto direito do cabeçalho, e selecione <strong>Meu Perfil</strong>.</p></li></ul></li><li><p class=\"my-4\"><strong>Vá para a aba Conta:</strong> Dentro da sua página de perfil, navegue até a última aba, chamada <strong>Conta</strong>.</p></li><li><p class=\"my-4\"><strong>Inicie o Encerramento:</strong></p><ul><li><p class=\"my-4\">No final da página, você encontrará a seção \"Encerrar Conta\".</p></li><li><p class=\"my-4\">Clique no botão <strong>Encerrar minha conta</strong>.</p></li></ul></li><li><p class=\"my-4\"><strong>Confirmação Final:</strong></p><ul><li><p class=\"my-4\">Uma janela de confirmação aparecerá, explicando as consequências da exclusão.</p></li><li><p class=\"my-4\">Para confirmar, você precisará seguir as instruções na tela e clicar no botão final de exclusão.</p></li></ul></li></ol><hr><p class=\"my-4\"><strong>Consequências da Exclusão</strong></p><ul><li><p class=\"my-4\"><strong>Para Alunos:</strong> Todo o seu histórico de treinos, avaliações e progresso será permanentemente removido. Você também será desvinculado de todos os professores que segue.</p></li><li><p class=\"my-4\"><strong>Para Professores:</strong> Além da exclusão de todos os seus dados (modelos, exercícios personalizados, etc.), a exclusão da sua conta resultará no <strong>cancelamento de todas as rotinas ativas</strong> dos seus alunos e na <strong>desvinculação automática</strong> de toda a sua base de clientes.</p></li></ul><p class=\"my-4\">Por favor, tenha certeza absoluta antes de confirmar a exclusão.</p>","category":"Meu Perfil","user_type":"ambos"}, 
 {"id":"651b64fb-5be6-427c-8a41-242a74662be3","title":"O que o aluno encontra em seu Painel Inicial?","content":"<p class=\"my-4\">Seu painel inicial é o seu centro de comando para acompanhar sua jornada fitness. Ele foi projetado para te dar acesso rápido a tudo o que você precisa.</p><p class=\"my-4\">Ele é dividido em duas áreas principais:</p><p class=\"my-4\"><strong>1. Indicadores de Acesso Rápido</strong></p><p class=\"my-4\">No topo da tela, você encontra quatro indicadores que funcionam como atalhos e resumos do seu progresso:</p><ul><li><p class=\"my-4\"><strong>Rotinas:</strong>&nbsp;Mostra se você tem uma rotina ativa no momento. Clicar aqui te leva para a página com os detalhes da sua rotina.</p></li><li><p class=\"my-4\"><strong>Sessões:</strong>&nbsp;Exibe o total de sessões de treino que você já concluiu da sua rotina atual. É um ótimo indicador do seu progresso!</p></li><li><p class=\"my-4\"><strong>Professores:</strong>&nbsp;Mostra quantos professores você segue.</p></li><li><p class=\"my-4\"><strong>Avaliações:</strong>&nbsp;Apresenta o total de avaliações físicas que você já realizou.</p></li></ul><p class=\"my-4\"><strong>2. Agendamentos</strong></p><p class=\"my-4\">Logo abaixo, você encontra sua agenda de compromissos com seus professores.</p><ul><li><p class=\"my-4\"><strong>Visualização Rápida:</strong>&nbsp;Veja seus próximos agendamentos, organizados por <strong>Hoje</strong>, <strong>Esta Semana</strong> e <strong>Próximos</strong>.</p></li><li><p class=\"my-4\"><strong>Gerenciamento de Convites:</strong>&nbsp;Quando um professor te envia um convite para uma Sessão de Treino ou Avaliação Física, ele aparecerá aqui com o status <strong>pendente</strong>. Você pode usar o menu de opções<code>&nbsp;</code><img class=\"inline-block h-[1.2em] w-auto -translate-y-px\" src=\"data:image/svg+xml,%3Csvg%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%20width%3D%2232%22%20height%3D%2232%22%20viewBox%3D%220%200%2032%2032%22%3E%3Ccircle%20cx%3D%2216%22%20cy%3D%2216%22%20r%3D%2216%22%20fill%3D%22%23f3f4f6%22%2F%3E%3Cg%20transform%3D%22translate(4%2C%204)%22%20stroke%3D%22currentColor%22%20stroke-width%3D%222%22%20stroke-linecap%3D%22round%22%20stroke-linejoin%3D%22round%22%20fill%3D%22none%22%3E%3Ccircle%20cx%3D%2212%22%20cy%3D%2212%22%20r%3D%221%22%2F%3E%3Ccircle%20cx%3D%2212%22%20cy%3D%225%22%20r%3D%221%22%2F%3E%3Ccircle%20cx%3D%2212%22%20cy%3D%2219%22%20r%3D%221%22%2F%3E%3C%2Fg%3E%3C%2Fsvg%3E\" alt=\"Ícone de Menu\"> para&nbsp;<strong>Confirmar</strong>&nbsp;ou&nbsp;<strong>Recusar</strong>&nbsp;o convite. Se recusar, você poderá enviar uma mensagem explicando o motivo.</p></li><li><p class=\"my-4\"><strong>Acesso ao Calendário:</strong>&nbsp;Para uma visão completa da sua agenda, utilize o&nbsp;<strong>botão de Agenda</strong>&nbsp;<img class=\"inline-block h-[1.2em] w-auto -translate-y-px\" src=\"data:image/svg+xml,%3Csvg%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%20width%3D%2232%22%20height%3D%2232%22%20viewBox%3D%220%200%2032%2032%22%3E%3Ccircle%20cx%3D%2216%22%20cy%3D%2216%22%20r%3D%2216%22%20fill%3D%22%23f3f4f6%22%2F%3E%3Cg%20transform%3D%22translate(4%2C%204)%22%20stroke%3D%22currentColor%22%20stroke-width%3D%222%22%20stroke-linecap%3D%22round%22%20stroke-linejoin%3D%22round%22%20fill%3D%22none%22%3E%3Crect%20width%3D%2218%22%20height%3D%2218%22%20x%3D%223%22%20y%3D%224%22%20rx%3D%222%22%20ry%3D%222%22%2F%3E%3Cline%20x1%3D%2216%22%20x2%3D%2216%22%20y1%3D%222%22%20y2%3D%226%22%2F%3E%3Cline%20x1%3D%228%22%20x2%3D%228%22%20y1%3D%222%22%20y2%3D%226%22%2F%3E%3Cline%20x1%3D%223%22%20x2%3D%2221%22%20y1%3D%2210%22%20y2%3D%2210%22%2F%3E%3C%2Fg%3E%3C%2Fsvg%3E\" alt=\"Ícone de Agenda\"> no canto inferior da tela.</p></li></ul><p class=\"my-4\">Este painel é o seu ponto de partida para treinar, acompanhar sua evolução e se comunicar com seu professor!</p>","category":"Painel Inicial","user_type":"aluno"}, 
 {"id":"79077709-07e9-460e-b26d-5e2d41e1941c","title":"O que o professor encontra em seu Painel Inicial?","content":"<p class=\"my-4\">Seu painel inicial é o ponto de partida para gerenciar todas as suas atividades na plataforma. Ele foi projetado para te dar uma visão geral e acesso rápido às seções mais importantes.</p><p class=\"my-4\">Ele é dividido em duas áreas principais:</p><p class=\"my-4\"><strong>1. Indicadores de Acesso Rápido</strong></p><p class=\"my-4\">No topo da tela, você encontra quatro indicadores que funcionam como atalhos e resumos:</p><ul><li><p class=\"my-4\"><strong>Alunos:</strong>&nbsp;Mostra o número total de alunos que seguem você.</p></li><li><p class=\"my-4\"><strong>Exercícios:</strong>&nbsp;Exibe a contagem de exercícios personalizados que você criou.</p></li><li><p class=\"my-4\"><strong>Rotinas:</strong>&nbsp;Apresenta o total de rotinas de treino atualmente ativas.</p></li><li><p class=\"my-4\"><strong>Avaliações:</strong>&nbsp;Mostra a quantidade de avaliações físicas que você realizou no último ano.</p></li></ul><p class=\"my-4\">Clicar em qualquer um desses indicadores te levará diretamente para a página correspondente.</p><p class=\"my-4\"><strong>2. Agendamentos</strong></p><p class=\"my-4\">Logo abaixo dos indicadores, você tem a sua agenda de compromissos. Aqui você pode:</p><ul><li><p class=\"my-4\"><strong>Visualizar:</strong>&nbsp;Ver seus próximos agendamentos, organizados por <strong>Hoje</strong>, <strong>Esta Semana</strong> e <strong>Próximos</strong>.</p></li><li><p class=\"my-4\"><strong>Gerenciar:</strong>&nbsp;Cada agendamento mostra o aluno, o tipo de compromisso (Sessão de Treino ou Avaliação Física) e o status (Pendente, Confirmado ou Recusado).</p></li><li><p class=\"my-4\"><strong>Agir:</strong>&nbsp;Você pode&nbsp;<strong>Reagendar</strong>&nbsp;um compromisso recusado pelo aluno ou&nbsp;<strong>Excluir</strong>&nbsp;um agendamento.</p></li></ul><p class=\"my-4\">Para criar um novo agendamento, utilize o&nbsp;<strong>botão de Agenda</strong>&nbsp;<img class=\"inline-block h-[1.2em] w-auto -translate-y-px\" src=\"data:image/svg+xml,%3Csvg%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%20width%3D%2232%22%20height%3D%2232%22%20viewBox%3D%220%200%2032%2032%22%3E%3Ccircle%20cx%3D%2216%22%20cy%3D%2216%22%20r%3D%2216%22%20fill%3D%22%23f3f4f6%22%2F%3E%3Cg%20transform%3D%22translate(4%2C%204)%22%20stroke%3D%22currentColor%22%20stroke-width%3D%222%22%20stroke-linecap%3D%22round%22%20stroke-linejoin%3D%22round%22%20fill%3D%22none%22%3E%3Crect%20width%3D%2218%22%20height%3D%2218%22%20x%3D%223%22%20y%3D%224%22%20rx%3D%222%22%20ry%3D%222%22%2F%3E%3Cline%20x1%3D%2216%22%20x2%3D%2216%22%20y1%3D%222%22%20y2%3D%226%22%2F%3E%3Cline%20x1%3D%228%22%20x2%3D%228%22%20y1%3D%222%22%20y2%3D%226%22%2F%3E%3Cline%20x1%3D%223%22%20x2%3D%2221%22%20y1%3D%2210%22%20y2%3D%2210%22%2F%3E%3C%2Fg%3E%3C%2Fsvg%3E\" alt=\"Ícone de Agenda\">&nbsp;no canto inferior da tela, que te levará diretamente para o seu calendário.</p>","category":"Painel Inicial","user_type":"professor"}, 
 {"id":"936a4912-6a15-467b-af9e-f1e72ceca50d","title":"Como faço para criar um novo agendamento?","content":"<p class=\"my-4\">Para criar um novo agendamento para uma sessão de treino ou avaliação física, o caminho principal é através do seu calendário.</p><ol><li><p class=\"my-4\"><strong>Acesse o Calendário:</strong>&nbsp;No seu&nbsp;<strong>Painel Inicial</strong>, clique no botão flutuante de Agenda<code>&nbsp;</code><img class=\"inline-block h-[1.2em] w-auto -translate-y-px\" src=\"data:image/svg+xml,%3Csvg%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%20width%3D%2232%22%20height%3D%2232%22%20viewBox%3D%220%200%2032%2032%22%3E%3Ccircle%20cx%3D%2216%22%20cy%3D%2216%22%20r%3D%2216%22%20fill%3D%22%23f3f4f6%22%2F%3E%3Cg%20transform%3D%22translate(4%2C%204)%22%20stroke%3D%22currentColor%22%20stroke-width%3D%222%22%20stroke-linecap%3D%22round%22%20stroke-linejoin%3D%22round%22%20fill%3D%22none%22%3E%3Crect%20width%3D%2218%22%20height%3D%2218%22%20x%3D%223%22%20y%3D%224%22%20rx%3D%222%22%20ry%3D%222%22%2F%3E%3Cline%20x1%3D%2216%22%20x2%3D%2216%22%20y1%3D%222%22%20y2%3D%226%22%2F%3E%3Cline%20x1%3D%228%22%20x2%3D%228%22%20y1%3D%222%22%20y2%3D%226%22%2F%3E%3Cline%20x1%3D%223%22%20x2%3D%2221%22%20y1%3D%2210%22%20y2%3D%2210%22%2F%3E%3C%2Fg%3E%3C%2Fsvg%3E\" alt=\"Ícone de Agenda\"> localizado no canto inferior direito da tela.</p></li><li><p class=\"my-4\"><strong>Crie o Evento:</strong>&nbsp;Você será direcionado para a sua página de Calendário. Clique diretamente no dia desejado para abrir o formulário de criação de agendamento.</p></li><li><p class=\"my-4\"><strong>Preencha os Detalhes:</strong>&nbsp;No formulário, selecione o aluno, o tipo de evento (Sessão de Treino ou Avaliação Física), a data, a hora e adicione uma nota se desejar.</p></li></ol><p class=\"my-4\">Após enviar, o aluno será notificado para confirmar o convite. Você pode acompanhar o status de todos os seus agendamentos no seu Painel Inicial.</p>","category":"Painel Inicial","user_type":"professor"}, 
 {"id":"09715835-c521-4455-a726-3913cdfcf8e9","title":"Como reagendo ou excluo um agendamento?","content":"<p class=\"my-4\">No painel inicial, encontre o agendamento desejado. Clique no menu de opções&nbsp;<img class=\"inline-block h-[1.2em] w-auto -translate-y-px\" src=\"data:image/svg+xml,%3Csvg%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%20width%3D%2232%22%20height%3D%2232%22%20viewBox%3D%220%200%2032%2032%22%3E%3Ccircle%20cx%3D%2216%22%20cy%3D%2216%22%20r%3D%2216%22%20fill%3D%22%23f3f4f6%22%2F%3E%3Cg%20transform%3D%22translate(4%2C%204)%22%20stroke%3D%22currentColor%22%20stroke-width%3D%222%22%20stroke-linecap%3D%22round%22%20stroke-linejoin%3D%22round%22%20fill%3D%22none%22%3E%3Ccircle%20cx%3D%2212%22%20cy%3D%2212%22%20r%3D%221%22%2F%3E%3Ccircle%20cx%3D%2212%22%20cy%3D%225%22%20r%3D%221%22%2F%3E%3Ccircle%20cx%3D%2212%22%20cy%3D%2219%22%20r%3D%221%22%2F%3E%3C%2Fg%3E%3C%2Fsvg%3E\" alt=\"Ícone de Menu\"> e selecione <strong>Reagendar</strong>&nbsp;para propor um novo horário, ou <strong>Excluir</strong> para remover o compromisso permanentemente. O aluno será notificado da alteração.</p>","category":"Painel Inicial","user_type":"professor"}, 
 {"id":"5757e98c-dcd2-4342-9859-2499a2fe83a2","title":"Como respondo a um convite de agendamento?","content":"<p class=\"my-4\">Novos convites de agendamento aparecerão no seu painel inicial com o status <strong>Pendente</strong>. Você pode clicar em <strong>Confirmar</strong>&nbsp;para aceitar o horário, ou <strong>Recusar</strong>&nbsp;para informar ao professor que não poderá comparecer. Ao recusar, é importante deixar uma mensagem explicando o motivo.</p>","category":"Painel Inicial","user_type":"aluno"}, 
 {"id":"de399481-de64-4b43-abfc-6ae764f87e54","title":"O que significam as cores na agenda?","content":"<p class=\"my-4\">As cores dos agendamentos indicam sua situação atual:</p><p class=\"my-4\"><strong>Laranja (Pendente):</strong> Aguardando a confirmação do aluno.</p><p class=\"my-4\"><strong>Verde (Confirmado):</strong> O agendamento foi aceito por ambos.</p><p class=\"my-4\"><strong>Vermelho (Recusado):</strong> O aluno não pôde aceitar o convite.</p><p class=\"my-4\"><strong>Azul (Concluído):</strong> O horário do agendamento já passou.</p>","category":"Painel Inicial","user_type":"ambos"}, 
 {"id":"19f3dede-b7df-44c6-9dfa-3e9c99731e81","title":"Posso cancelar um agendamento que já confirmei?","content":"<p class=\"my-4\">Sim. Se você já confirmou um agendamento mas precisa cancelar, acesse o evento na sua agenda e use a opção <strong>Recusar</strong>. Isso notificará seu professor. Lembre-se de comunicar o motivo com antecedência.</p>","category":"Painel Inicial","user_type":"aluno"}, 
 {"id":"6d18cdb1-4999-40f9-b0a9-5cafd66b2830","title":"Um aluno recusou um agendamento. O que acontece?","content":"<p class=\"my-4\">Quando um aluno recusa um agendamento, você verá o status <strong>recusado</strong>&nbsp;na sua agenda, junto com o motivo informado por ele. Você pode então entrar em contato para combinar um novo horário e usar a opção <strong>Reagendar</strong> para enviar um novo convite.</p>","category":"Painel Inicial","user_type":"professor"}, 
 {"id":"3e178233-3059-43a2-a6a1-4cb347ef0226","title":"Como adiciono um novo aluno?","content":"<p class=\"my-4\">Na página <strong>Alunos</strong>, clique no botão adicionar <img class=\"inline-block h-[1.2em] w-auto -translate-y-px\" src=\"data:image/svg+xml,%3Csvg%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%20width%3D%2232%22%20height%3D%2232%22%20viewBox%3D%220%200%2032%2032%22%3E%3Ccircle%20cx%3D%2216%22%20cy%3D%2216%22%20r%3D%2216%22%20fill%3D%22%23f3f4f6%22%2F%3E%3Cg%20transform%3D%22translate(4%2C%204)%22%20stroke%3D%22currentColor%22%20stroke-width%3D%222%22%20stroke-linecap%3D%22round%22%20stroke-linejoin%3D%22round%22%20fill%3D%22none%22%3E%3Cpath%20d%3D%22M5%2012h14%22%2F%3E%3Cpath%20d%3D%22M12%205v14%22%2F%3E%3C%2Fg%3E%3C%2Fsvg%3E\" alt=\"Ícone de Adicionar\">. Um modal será aberto com duas abas principais:</p><p class=\"my-4\"><strong>Aba Convidar:</strong> Use quando o aluno ainda não tem conta no Titans. Você pode enviar um convite por <strong>Email</strong> ou gerar um <strong>QR Code</strong> para ele escanear e se cadastrar.</p><p class=\"my-4\"><strong>Aba Vincular:</strong> Use quando o aluno já possui uma conta. Basta inserir o <strong>Código de Identificação</strong> de 6 caracteres que ele fornece.</p><p class=\"my-4\">Escolha o método mais adequado para cada situação. Veja os artigos específicos para o passo a passo detalhado de cada opção.</p>","category":"Alunos","user_type":"professor"}, 
 {"id":"21100cc7-3794-4f4f-b45d-0dccd566c889","title":"Como convido um aluno por email?","content":"<p class=\"my-4\">Use este método quando o aluno ainda <strong>não possui conta</strong> no Titans e você tem o email dele.</p><p class=\"my-4\"><strong>Passo a passo:</strong></p><ol class=\"list-decimal pl-6 my-4\"><li>Na página <strong>Alunos</strong>, clique no botão adicionar <img class=\"inline-block h-[1.2em] w-auto -translate-y-px\" src=\"data:image/svg+xml,%3Csvg%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%20width%3D%2232%22%20height%3D%2232%22%20viewBox%3D%220%200%2032%2032%22%3E%3Ccircle%20cx%3D%2216%22%20cy%3D%2216%22%20r%3D%2216%22%20fill%3D%22%23f3f4f6%22%2F%3E%3Cg%20transform%3D%22translate(4%2C%204)%22%20stroke%3D%22currentColor%22%20stroke-width%3D%222%22%20stroke-linecap%3D%22round%22%20stroke-linejoin%3D%22round%22%20fill%3D%22none%22%3E%3Cpath%20d%3D%22M5%2012h14%22%2F%3E%3Cpath%20d%3D%22M12%205v14%22%2F%3E%3C%2Fg%3E%3C%2Fsvg%3E\" alt=\"Ícone de Adicionar\"></li><li>Selecione a aba <strong>Convidar</strong></li><li>Escolha a opção <strong>Por Email</strong></li><li>Digite o email do aluno e clique em <strong>Enviar Convite</strong></li></ol><p class=\"my-4\"><strong>O que acontece depois:</strong></p><ul class=\"list-disc pl-6 my-4\"><li>O aluno receberá um email com um link para se cadastrar</li><li>Ao clicar no link, ele será direcionado para criar a conta</li><li>Após completar o cadastro, o vínculo com você será criado automaticamente</li><li>O aluno aparecerá na sua lista com status <strong>Pendente</strong> até finalizar o onboarding</li></ul>","category":"Alunos","user_type":"professor"}, 
 {"id":"534e665c-4b56-4b35-b53d-5afeef17347a","title":"Como convido um aluno por QR Code?","content":"<p class=\"my-4\">Use este método para cadastrar alunos <strong>presencialmente</strong>. Ideal para quando você está com o aluno ao seu lado.</p><p class=\"my-4\"><strong>Passo a passo:</strong></p><ol class=\"list-decimal pl-6 my-4\"><li>Na página <strong>Alunos</strong>, clique no botão adicionar <img class=\"inline-block h-[1.2em] w-auto -translate-y-px\" src=\"data:image/svg+xml,%3Csvg%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%20width%3D%2232%22%20height%3D%2232%22%20viewBox%3D%220%200%2032%2032%22%3E%3Ccircle%20cx%3D%2216%22%20cy%3D%2216%22%20r%3D%2216%22%20fill%3D%22%23f3f4f6%22%2F%3E%3Cg%20transform%3D%22translate(4%2C%204)%22%20stroke%3D%22currentColor%22%20stroke-width%3D%222%22%20stroke-linecap%3D%22round%22%20stroke-linejoin%3D%22round%22%20fill%3D%22none%22%3E%3Cpath%20d%3D%22M5%2012h14%22%2F%3E%3Cpath%20d%3D%22M12%205v14%22%2F%3E%3C%2Fg%3E%3C%2Fsvg%3E\" alt=\"Ícone de Adicionar\"></li><li>Selecione a aba <strong>Convidar</strong></li><li>Escolha a opção <strong>QR Code</strong></li><li>Um código QR será gerado automaticamente na tela</li><li>Peça ao aluno para escanear o código com a câmera do celular</li></ol><p class=\"my-4\"><strong>O que acontece depois:</strong></p><ul class=\"list-disc pl-6 my-4\"><li>O aluno será direcionado para a página de cadastro</li><li>Após criar a conta, o vínculo com você será estabelecido automaticamente</li></ul><p class=\"my-4\"><strong>Importante:</strong> Cada QR Code é de <strong>uso único</strong>. Após um aluno utilizá-lo, você precisará gerar um novo código para o próximo aluno clicando em <strong>Gerar novo código</strong>.</p>","category":"Alunos","user_type":"professor"}, 
 {"id":"a4483635-b02b-4715-86ec-d6419d467ec9","title":"Como vinculo um aluno pelo código?","content":"<p class=\"my-4\">Use este método quando o aluno <strong>já possui uma conta</strong> no Titans e quer ser adicionado à sua lista.</p><p class=\"my-4\"><strong>Passo a passo:</strong></p><ol class=\"list-decimal pl-6 my-4\"><li>Na página <strong>Alunos</strong>, clique no botão adicionar <img class=\"inline-block h-[1.2em] w-auto -translate-y-px\" src=\"data:image/svg+xml,%3Csvg%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%20width%3D%2232%22%20height%3D%2232%22%20viewBox%3D%220%200%2032%2032%22%3E%3Ccircle%20cx%3D%2216%22%20cy%3D%2216%22%20r%3D%2216%22%20fill%3D%22%23f3f4f6%22%2F%3E%3Cg%20transform%3D%22translate(4%2C%204)%22%20stroke%3D%22currentColor%22%20stroke-width%3D%222%22%20stroke-linecap%3D%22round%22%20stroke-linejoin%3D%22round%22%20fill%3D%22none%22%3E%3Cpath%20d%3D%22M5%2012h14%22%2F%3E%3Cpath%20d%3D%22M12%205v14%22%2F%3E%3C%2Fg%3E%3C%2Fsvg%3E\" alt=\"Ícone de Adicionar\"></li><li>Selecione a aba <strong>Vincular</strong></li><li>Peça ao aluno o <strong>Código de Identificação</strong> dele (6 caracteres)</li><li>Digite o código e clique em <strong>Buscar</strong></li><li>O sistema exibirá os dados do aluno para confirmação</li><li>Clique em <strong>Adicionar</strong> para criar o vínculo</li></ol><p class=\"my-4\"><strong>Onde o aluno encontra o código?</strong></p><p class=\"my-4\">O aluno pode ver seu código clicando no próprio avatar (foto de perfil) no menu principal do aplicativo. O código aparece logo abaixo do nome.</p><p class=\"my-4\"><strong>Quando usar:</strong> Este método é ideal para alunos que já treinam com outro professor no Titans ou que criaram a conta de forma independente.</p>","category":"Alunos","user_type":"professor"}, 
 {"id":"9408c9a3-1a36-4af7-bd67-7df29a023040","title":"Como removo o vínculo com um aluno?","content":"<p class=\"my-4\">Na página <strong>Alunos</strong>, encontre o cartão do aluno que deseja remover. Clique no menu de opções&nbsp;<img class=\"inline-block h-[1.2em] w-auto -translate-y-px\" src=\"data:image/svg+xml,%3Csvg%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%20width%3D%2232%22%20height%3D%2232%22%20viewBox%3D%220%200%2032%2032%22%3E%3Ccircle%20cx%3D%2216%22%20cy%3D%2216%22%20r%3D%2216%22%20fill%3D%22%23f3f4f6%22%2F%3E%3Cg%20transform%3D%22translate(4%2C%204)%22%20stroke%3D%22currentColor%22%20stroke-width%3D%222%22%20stroke-linecap%3D%22round%22%20stroke-linejoin%3D%22round%22%20fill%3D%22none%22%3E%3Ccircle%20cx%3D%2212%22%20cy%3D%2212%22%20r%3D%221%22%2F%3E%3Ccircle%20cx%3D%2212%22%20cy%3D%225%22%20r%3D%221%22%2F%3E%3Ccircle%20cx%3D%2212%22%20cy%3D%2219%22%20r%3D%221%22%2F%3E%3C%2Fg%3E%3C%2Fsvg%3E\" alt=\"Ícone de Menu\">&nbsp; e selecione <strong>Desvincular</strong>. Uma confirmação será solicitada.</p><p class=\"my-4\"><strong>Atenção: esta ação é importante</strong>. Ao confirmar a desvinculação:</p><p class=\"my-4\">Você perderá o acesso imediato a todos os dados do aluno, incluindo histórico e avaliações.</p><p class=\"my-4\">Se o aluno tiver uma rotina de treino criada por você, ela será <strong>automaticamente cancelada e arquivada</strong></p><p class=\"my-4\">O aluno será notificado sobre a desvinculação.</p><p class=\"my-4\">Esta ação remove apenas o seu vínculo com o aluno, não exclui a conta dele.</p>","category":"Alunos","user_type":"professor"}, 
 {"id":"0c54663f-c6ad-48b1-b325-571d121752fa","title":"O que posso fazer na página de um aluno?","content":"<p class=\"my-4\">Ao clicar em um aluno na sua lista, você acessa um menu de opções <img class=\"inline-block h-[1.2em] w-auto -translate-y-px\" src=\"data:image/svg+xml,%3Csvg%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%20width%3D%2232%22%20height%3D%2232%22%20viewBox%3D%220%200%2032%2032%22%3E%3Ccircle%20cx%3D%2216%22%20cy%3D%2216%22%20r%3D%2216%22%20fill%3D%22%23f3f4f6%22%2F%3E%3Cg%20transform%3D%22translate(4%2C%204)%22%20stroke%3D%22currentColor%22%20stroke-width%3D%222%22%20stroke-linecap%3D%22round%22%20stroke-linejoin%3D%22round%22%20fill%3D%22none%22%3E%3Ccircle%20cx%3D%2212%22%20cy%3D%2212%22%20r%3D%221%22%2F%3E%3Ccircle%20cx%3D%2212%22%20cy%3D%225%22%20r%3D%221%22%2F%3E%3Ccircle%20cx%3D%2212%22%20cy%3D%2219%22%20r%3D%221%22%2F%3E%3C%2Fg%3E%3C%2Fsvg%3E\" alt=\"Ícone de Menu\">&nbsp;com várias ações de gerenciamento:</p><p class=\"my-4\"><strong>Ver Detalhes</strong>: Visualiza as informações pessoais do aluno (nome, email, telefone, etc.). Essas informações são editáveis apenas pelo próprio aluno.<strong> </strong>Para garantir a privacidade e o controle do aluno sobre seus próprios dados (em conformidade com a LGPD), apenas ele pode alterar suas informações pessoais. Como professor, você tem acesso de visualização para poder se comunicar e gerenciar os treinos.</p><p class=\"my-4\"><strong>Rotinas:</strong>&nbsp;Acessa a página de gerenciamento de rotinas exclusiva daquele aluno, onde você pode criar, editar, visualizar e gerenciar as rotinas dele.</p><p class=\"my-4\"><strong>Avaliações:</strong>&nbsp;Leva para a tela de avaliações físicas, onde você pode registrar novas medidas e fotos ou ver o histórico de progresso.</p><p class=\"my-4\"><strong>PAR-Q:</strong>&nbsp;Permite consultar as respostas do Questionário de Prontidão para Atividade Física preenchido pelo aluno.</p>","category":"Alunos","user_type":"professor"}, 
 {"id":"936c8748-12ba-45f2-b911-53b2577aa74d","title":"O que significa a situação Pendente em um aluno?","content":"<p class=\"my-4\">A situação&nbsp;<strong>Pendente</strong>&nbsp;indica que o aluno criou a conta, mas ainda não completou a etapa de configuração inicial do perfil (Onboarding). Você pode se comunicar com ele, mas algumas funcionalidades, como a criação de rotinas, podem depender da finalização do cadastro por parte do aluno.</p>","category":"Alunos","user_type":"professor"}, 
 {"id":"54cb2a68-4f88-430a-995c-8569506fc3aa","title":"Qual a diferença entre as páginas Rotinas no menu de opções do aluno e no menu principal?","content":"<p class=\"my-4\"><strong>Rotinas (botão de opções </strong><img class=\"inline-block h-[1.2em] w-auto -translate-y-px\" src=\"data:image/svg+xml,%3Csvg%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%20width%3D%2232%22%20height%3D%2232%22%20viewBox%3D%220%200%2032%2032%22%3E%3Ccircle%20cx%3D%2216%22%20cy%3D%2216%22%20r%3D%2216%22%20fill%3D%22%23f3f4f6%22%2F%3E%3Cg%20transform%3D%22translate(4%2C%204)%22%20stroke%3D%22currentColor%22%20stroke-width%3D%222%22%20stroke-linecap%3D%22round%22%20stroke-linejoin%3D%22round%22%20fill%3D%22none%22%3E%3Ccircle%20cx%3D%2212%22%20cy%3D%2212%22%20r%3D%221%22%2F%3E%3Ccircle%20cx%3D%2212%22%20cy%3D%225%22%20r%3D%221%22%2F%3E%3Ccircle%20cx%3D%2212%22%20cy%3D%2219%22%20r%3D%221%22%2F%3E%3C%2Fg%3E%3C%2Fsvg%3E\" alt=\"Ícone de Menu\">&nbsp;<strong>do aluno):</strong> É a visão focada em um único aluno. Mostra todas as rotinas dele, incluindo a atual, rascunhos e o histórico de rotinas encerradas. É aqui que você cria uma nova rotina para ele.</p><p class=\"my-4\"><strong>Rotinas (menu principal):</strong>&nbsp;É um painel de controle geral. Ele exibe uma lista de todas as rotinas que estão atualmente ativas, agrupadas por aluno. É ideal para ter uma visão rápida de quem está treinando e o que está em andamento.</p>","category":"Alunos","user_type":"professor"}, 
 {"id":"5ac9103f-d501-4d3d-814f-f48df2bf11b1","title":"Qual a diferença entre as páginas Avaliações no menu de opções do aluno e no menu principal?","content":"<p class=\"my-4\">Você pode gerenciar as avaliações físicas dos seus alunos de duas maneiras, cada uma com um foco diferente:</p><ul><li><p class=\"my-4\"><strong>Avaliações (botão de opções </strong><img class=\"inline-block h-[1.2em] w-auto -translate-y-px\" src=\"data:image/svg+xml,%3Csvg%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%20width%3D%2232%22%20height%3D%2232%22%20viewBox%3D%220%200%2032%2032%22%3E%3Ccircle%20cx%3D%2216%22%20cy%3D%2216%22%20r%3D%2216%22%20fill%3D%22%23f3f4f6%22%2F%3E%3Cg%20transform%3D%22translate(4%2C%204)%22%20stroke%3D%22currentColor%22%20stroke-width%3D%222%22%20stroke-linecap%3D%22round%22%20stroke-linejoin%3D%22round%22%20fill%3D%22none%22%3E%3Ccircle%20cx%3D%2212%22%20cy%3D%2212%22%20r%3D%221%22%2F%3E%3Ccircle%20cx%3D%2212%22%20cy%3D%225%22%20r%3D%221%22%2F%3E%3Ccircle%20cx%3D%2212%22%20cy%3D%2219%22%20r%3D%221%22%2F%3E%3C%2Fg%3E%3C%2Fsvg%3E\" alt=\"Ícone de Menu\">&nbsp;<strong>do aluno):</strong> Acessada pela página <strong>Alunos</strong>, esta é a visão focada em um único aluno. Ela mostra o histórico completo de avaliações, gráficos de evolução e a ferramenta de comparação de fotos Antes X Depois apenas para ele. É o local ideal para uma análise aprofundada do progresso de um aluno específico e para criar uma nova avaliação para ele.</p></li><li><p class=\"my-4\"><strong>Avaliações (menu principal):</strong> Este é o seu painel de controle geral. Ele exibe uma lista de todos os seus alunos que possuem avaliações, permitindo que você tenha uma visão rápida do histórico de cada um. É o melhor caminho para ter uma visão geral de todos e para iniciar a criação de uma nova avaliação para qualquer um dos seus alunos através do botão de adicionar <img class=\"inline-block h-[1.2em] w-auto -translate-y-px\" src=\"data:image/svg+xml,%3Csvg%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%20width%3D%2232%22%20height%3D%2232%22%20viewBox%3D%220%200%2032%2032%22%3E%3Ccircle%20cx%3D%2216%22%20cy%3D%2216%22%20r%3D%2216%22%20fill%3D%22%23f3f4f6%22%2F%3E%3Cg%20transform%3D%22translate(4%2C%204)%22%20stroke%3D%22currentColor%22%20stroke-width%3D%222%22%20stroke-linecap%3D%22round%22%20stroke-linejoin%3D%22round%22%20fill%3D%22none%22%3E%3Cpath%20d%3D%22M5%2012h14%22%2F%3E%3Cpath%20d%3D%22M12%205v14%22%2F%3E%3C%2Fg%3E%3C%2Fsvg%3E\" alt=\"Ícone de Adicionar\">.</p></li></ul><p class=\"my-4\"></p>","category":"Alunos","user_type":"professor"}, 
 {"id":"97bb542c-3d67-4f51-8988-6deeb73ed398","title":"Qual a diferença entre exercícios Padrão e Personalizados?","content":"<p class=\"my-4\">A plataforma oferece dois tipos de exercícios:</p><p class=\"my-4\"><strong>Exercícios Padrão</strong>: São uma biblioteca de exercícios criada e mantida pela equipe do Titans Fitness. Eles são os blocos de construção que você usará para montar as rotinas de treino para seus alunos. Você não pode editá-los, mas pode visualizá-los e criar cópias personalizadas a partir deles.</p><p class=\"my-4\"><strong>Exercícios Personalizados</strong>: São exercícios que pertencem exclusivamente a você. Eles podem ser criados do zero ou a partir de uma cópia de um exercício padrão. Você tem total controle para editá-los ou excluí-los a qualquer momento.</p>","category":"Exercícios","user_type":"professor"}, 
 {"id":"bbaa2d33-1b27-41b1-9c91-1010f091c6ec","title":"Como crio um exercício personalizado?","content":"<p class=\"my-4\">Você pode criar um exercício personalizado de duas formas na página <strong>Exercícios</strong>:</p><p class=\"my-4\"><strong>Do zero</strong>: Na aba <strong>Personalizados</strong>, clique no botão <strong>Novo Exercício</strong>. Você preencherá todas as informações, como nome, descrição e mídias.</p><p class=\"my-4\"><strong>Copiando um exercício padrão</strong>: Na aba <strong>Padrão</strong>, encontre o exercício que deseja usar como base, abra o menu de opções&nbsp;<img class=\"inline-block h-[1.2em] w-auto -translate-y-px\" src=\"data:image/svg+xml,%3Csvg%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%20width%3D%2232%22%20height%3D%2232%22%20viewBox%3D%220%200%2032%2032%22%3E%3Ccircle%20cx%3D%2216%22%20cy%3D%2216%22%20r%3D%2216%22%20fill%3D%22%23f3f4f6%22%2F%3E%3Cg%20transform%3D%22translate(4%2C%204)%22%20stroke%3D%22currentColor%22%20stroke-width%3D%222%22%20stroke-linecap%3D%22round%22%20stroke-linejoin%3D%22round%22%20fill%3D%22none%22%3E%3Ccircle%20cx%3D%2212%22%20cy%3D%2212%22%20r%3D%221%22%2F%3E%3Ccircle%20cx%3D%2212%22%20cy%3D%225%22%20r%3D%221%22%2F%3E%3Ccircle%20cx%3D%2212%22%20cy%3D%2219%22%20r%3D%221%22%2F%3E%3C%2Fg%3E%3C%2Fsvg%3E\" alt=\"Ícone de Menu\"> e selecione <strong>Criar Cópia</strong>. Isso pré-preencherá o formulário com os dados do exercício padrão, e você poderá fazer as modificações que desejar.</p>","category":"Exercícios","user_type":"professor"}, 
 {"id":"c27b2b82-ca2c-4a71-8d4a-3a246005dd56","title":"Existe um limite para exercícios personalizados?","content":"<p class=\"my-4\">Sim. Cada professor pode criar até <strong>100 exercícios personalizados</strong>. Este limite nos ajuda a manter a plataforma otimizada. Se você atingir o limite, o botão para criar novos exercícios ficará desabilitado e você precisará excluir um exercício antigo para poder criar um novo.</p>","category":"Exercícios","user_type":"professor"}, 
 {"id":"10585d14-e314-4729-9b2a-e7f982209791","title":"Como encontro um exercício na biblioteca?","content":"<p class=\"my-4\">Na página <strong>Exercícios</strong>, você pode usar a barra de busca para procurar um exercício pelo nome. Além disso, você pode usar o botão de filtros&nbsp;<img class=\"inline-block h-[1.2em] w-auto -translate-y-px\" src=\"data:image/svg+xml,%3Csvg%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%20width%3D%2232%22%20height%3D%2232%22%20viewBox%3D%220%200%2032%2032%22%3E%3Ccircle%20cx%3D%2216%22%20cy%3D%2216%22%20r%3D%2216%22%20fill%3D%22%23f3f4f6%22%2F%3E%3Cg%20transform%3D%22translate(4%2C%204)%22%20stroke%3D%22currentColor%22%20stroke-width%3D%222%22%20stroke-linecap%3D%22round%22%20stroke-linejoin%3D%22round%22%20fill%3D%22none%22%3E%3Cpolygon%20points%3D%2222%203%202%203%2010%2012.46%2010%2019%2014%2021%2014%2012.46%2022%203%22%2F%3E%3C%2Fg%3E%3C%2Fsvg%3E\" alt=\"Ícone de Filtro\"> para refinar sua busca por Grupo Muscular, Equipamento ou Nível de Dificuldade.</p>","category":"Exercícios","user_type":"professor"}, 
 {"id":"39860d18-87cc-4f7c-a8ab-67a2bd9aa4de","title":"Como funciona o upload de mídias (fotos e vídeos) para os exercícios?","content":"<p class=\"my-4\">Ao criar ou editar um exercício personalizado, você pode adicionar até <strong>duas imagens e um vídeo</strong>&nbsp;para demonstrar a execução. Para garantir a performance do aplicativo, nosso sistema otimiza as mídias automaticamente no seu dispositivo antes de enviá-las.</p><p class=\"my-4\"><strong>Imagens</strong>: São redimensionadas e comprimidas para um carregamento rápido.</p><p class=\"my-4\"><strong>Vídeos</strong>:&nbsp;Gravar na hora pelo celular, o vídeo terá duração máxima de <strong>12 segundos</strong>&nbsp;e <strong>não terá áudio</strong>.</p><p class=\"my-4\"><strong>Link do YouTube:</strong>&nbsp;Além das mídias próprias, você pode colar um link de um vídeo do YouTube como referência adicional para o exercício.</p>","category":"Exercícios","user_type":"professor"}, 
 {"id":"e5b2dbb9-673b-474f-8bad-5a08b9e2d10b","title":"Posso editar ou excluir um exercício?","content":"<p class=\"my-4\"><strong>Exercícios Personalizados:</strong>&nbsp;Sim. Você pode editar ou excluir qualquer exercício que você criou. Na aba <strong>Personalizados</strong>, use o menu de opções em cada cartão de exercício.</p><p class=\"my-4\"><strong>Exercícios Padrão</strong>: Não. Os exercícios padrão são parte da biblioteca geral e não podem ser modificados ou excluídos por professores. Você pode, no entanto, criar uma cópia e editá-la como um exercício personalizado.</p>","category":"Exercícios","user_type":"professor"}, 
 {"id":"3556f800-5479-4868-829b-7cae44e06fae","title":"O que significam as situações da rotina (Ativa, Bloqueada, etc.)?","content":"<p class=\"my-4\">Os status indicam a situação atual de uma rotina de treino:<br><br><strong>Rascunho:&nbsp;</strong>Rotina em processo de criação pelo professor, ainda não finalizada.</p><p class=\"my-4\"><strong>Ativa:&nbsp;</strong>Aluno pode acessar e executar os treinos normalmente. A rotina é exibida na aba \"Atual\".</p><p class=\"my-4\"><strong>Bloqueada:&nbsp;</strong>Acesso aos treinos foi suspenso temporariamente pelo professor. A rotina é exibida na aba \"Atual\".</p><p class=\"my-4\"><strong>Cancelada:&nbsp;</strong>Rotina interrompida por uma ação administrativa, como a exclusão da conta do Professor. A rotina é movida para a aba \"Encerradas\" como parte do histórico.</p><p class=\"my-4\"><strong>Concluída:&nbsp;</strong>Todas as sessões da rotina foram executadas. A rotina é movida para a aba \"Encerradas\" como parte do histórico.</p>","category":"Rotinas de Treino (Criação)","user_type":"ambos"}, 
 {"id":"40cda979-012a-473d-a691-f86d3b967c68","title":"O aluno pode ter mais de uma rotina Ativa ao mesmo tempo?","content":"<p class=\"my-4\">Não. Para garantir foco e um acompanhamento preciso, cada aluno pode ter apenas uma rotina ativa/bloqueada (ou um rascunho) por vez. O sistema não permite a criação de uma nova rotina se já existir uma em andamento. Para criar uma nova, é necessário que a rotina em andamento seja finalizada ou excluída manualmente pelo professor ou pelo aluno. Isso garante que você sempre siga um plano de treino claro e coeso.</p>","category":"Rotinas de Treino (Criação)","user_type":"ambos"}, 
 {"id":"4d32b799-dd80-4b46-8c1d-486c320f31fe","title":"Como crio uma nova rotina para um aluno?","content":"<p class=\"my-4\">Você pode criar uma nova rotina de duas maneiras principais:</p><p class=\"my-4\"><strong>Pela página Alunos:</strong>&nbsp; Selecione o aluno desejado, no botão de opções&nbsp;<img class=\"inline-block h-[1.2em] w-auto -translate-y-px\" src=\"data:image/svg+xml,%3Csvg%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%20width%3D%2232%22%20height%3D%2232%22%20viewBox%3D%220%200%2032%2032%22%3E%3Ccircle%20cx%3D%2216%22%20cy%3D%2216%22%20r%3D%2216%22%20fill%3D%22%23f3f4f6%22%2F%3E%3Cg%20transform%3D%22translate(4%2C%204)%22%20stroke%3D%22currentColor%22%20stroke-width%3D%222%22%20stroke-linecap%3D%22round%22%20stroke-linejoin%3D%22round%22%20fill%3D%22none%22%3E%3Ccircle%20cx%3D%2212%22%20cy%3D%2212%22%20r%3D%221%22%2F%3E%3Ccircle%20cx%3D%2212%22%20cy%3D%225%22%20r%3D%221%22%2F%3E%3Ccircle%20cx%3D%2212%22%20cy%3D%2219%22%20r%3D%221%22%2F%3E%3C%2Fg%3E%3C%2Fsvg%3E\" alt=\"Ícone de Menu\"> &nbsp;clique em <strong>Rotinas</strong>,&nbsp;na aba <strong>Atual</strong> clique no botão&nbsp;<img class=\"inline-block h-[1.2em] w-auto -translate-y-px\" src=\"data:image/svg+xml,%3Csvg%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%20width%3D%2232%22%20height%3D%2232%22%20viewBox%3D%220%200%2032%2032%22%3E%3Ccircle%20cx%3D%2216%22%20cy%3D%2216%22%20r%3D%2216%22%20fill%3D%22%23f3f4f6%22%2F%3E%3Cg%20transform%3D%22translate(4%2C%204)%22%20stroke%3D%22currentColor%22%20stroke-width%3D%222%22%20stroke-linecap%3D%22round%22%20stroke-linejoin%3D%22round%22%20fill%3D%22none%22%3E%3Cpath%20d%3D%22M5%2012h14%22%2F%3E%3Cpath%20d%3D%22M12%205v14%22%2F%3E%3C%2Fg%3E%3C%2Fsvg%3E\" alt=\"Ícone de Adicionar\">&nbsp;para adicionar nova rotina .</p><p class=\"my-4\"><strong>Pela página Rotinas:</strong>&nbsp;Clique no botão&nbsp;<img class=\"inline-block h-[1.2em] w-auto -translate-y-px\" src=\"data:image/svg+xml,%3Csvg%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%20width%3D%2232%22%20height%3D%2232%22%20viewBox%3D%220%200%2032%2032%22%3E%3Ccircle%20cx%3D%2216%22%20cy%3D%2216%22%20r%3D%2216%22%20fill%3D%22%23f3f4f6%22%2F%3E%3Cg%20transform%3D%22translate(4%2C%204)%22%20stroke%3D%22currentColor%22%20stroke-width%3D%222%22%20stroke-linecap%3D%22round%22%20stroke-linejoin%3D%22round%22%20fill%3D%22none%22%3E%3Cpath%20d%3D%22M5%2012h14%22%2F%3E%3Cpath%20d%3D%22M12%205v14%22%2F%3E%3C%2Fg%3E%3C%2Fsvg%3E\" alt=\"Ícone de Adicionar\"> para adicionar uma nova rotina e uma lista com todos os seus alunos aparecerá para que você selecione para quem será a nova rotina.<br></p><p class=\"my-4\">Após iniciar por qualquer um dos caminhos, você terá a opção de <strong>Criar Rotina em Branco&nbsp;</strong>para começar do zero, ou <strong>Usar um Modelo</strong> para aplicar um template que você já salvou, agilizando o processo.</p>","category":"Rotinas de Treino (Criação)","user_type":"professor"}, 
 {"id":"17fe125c-03d6-4c24-8e20-edfe43c8a59e","title":"O que são Modelos de Rotina?","content":"<p class=\"my-4\">Modelos de Rotina são templates de treino que você pode criar e salvar para usar no futuro. Em vez de montar um treino do zero para cada novo aluno com objetivos similares, você pode simplesmente aplicar um modelo e fazer pequenos ajustes. Isso economiza muito tempo e padroniza seus métodos de treinamento. Você pode gerenciar seus modelos na página <strong>Meus Modelos</strong> do menu principal.</p>","category":"Rotinas de Treino (Criação)","user_type":"professor"}, 
 {"id":"15fde384-7d11-40ba-b6bb-c842397c9aab","title":"Otimizando seu tempo com Modelos de Rotina","content":"<h3><strong>Por que usar Modelos de Rotina?</strong></h3><p class=\"my-4\">Criar um plano de treino detalhado para cada aluno é um processo que exige tempo e atenção. Muitas vezes, alunos com perfis e objetivos semelhantes recebem rotinas com estruturas parecidas. A funcionalidade de <strong>Modelos de Rotina</strong>&nbsp;foi criada para transformar esse trabalho repetitivo em um processo rápido, eficiente e padronizado.</p><p class=\"my-4\">Um modelo é um <strong>esqueleto&nbsp;</strong>de uma rotina de treino completa que você cria e salva para usar quantas vezes quiser.</p><p class=\"my-4\"><strong>Principais Vantagens:</strong></p><p class=\"my-4\"><strong>Economia de Tempo Massiva</strong>: Em vez de começar do zero, você aplica um modelo pré-pronto e faz apenas os ajustes finos para cada aluno. O que levava horas agora pode ser feito em minutos.</p><p class=\"my-4\"><strong>Padronização e Qualidade:</strong>&nbsp;Garanta que todos os seus alunos com objetivos parecidos recebam a mesma base de treinamento de alta qualidade, seguindo sua metodologia. Isso cria consistência e profissionalismo no seu serviço.</p><p class=\"my-4\"><strong>Escalabilidade do seu Negócio:</strong>&nbsp;Com a agilidade proporcionada pelos modelos, você consegue atender mais alunos com a mesma qualidade, permitindo que seu negócio de consultoria cresça de forma sustentável.</p><p class=\"my-4\"><strong>Flexibilidade Total:</strong>&nbsp;Um modelo não é uma regra fixa. Após aplicá-lo a um aluno, você tem total liberdade para editar qualquer detalhe da rotina — desde a frequência semanal até a carga de um exercício específico — para adaptá-la perfeitamente às necessidades individuais daquele aluno.</p><p class=\"my-4\">Em resumo, usar modelos é a forma mais inteligente de otimizar seu fluxo de trabalho, manter um alto padrão de qualidade e focar no que realmente importa: o acompanhamento e a evolução dos seus alunos.</p><p class=\"my-4\"></p>","category":"Rotinas de Treino (Criação)","user_type":"professor"}, 
 {"id":"81bbbe60-f686-4e34-8c73-b64f3e68edd2","title":"Como crio um modelo de rotina?","content":"<p class=\"my-4\">O processo de criação é dividido em 3 etapas simples e intuitivas. Para começar, vá para a página de <strong>Modelos de Rotina</strong> e clique no botão&nbsp;<img class=\"inline-block h-[1.2em] w-auto -translate-y-px\" src=\"data:image/svg+xml,%3Csvg%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%20width%3D%2232%22%20height%3D%2232%22%20viewBox%3D%220%200%2032%2032%22%3E%3Ccircle%20cx%3D%2216%22%20cy%3D%2216%22%20r%3D%2216%22%20fill%3D%22%23f3f4f6%22%2F%3E%3Cg%20transform%3D%22translate(4%2C%204)%22%20stroke%3D%22currentColor%22%20stroke-width%3D%222%22%20stroke-linecap%3D%22round%22%20stroke-linejoin%3D%22round%22%20fill%3D%22none%22%3E%3Cpath%20d%3D%22M5%2012h14%22%2F%3E%3Cpath%20d%3D%22M12%205v14%22%2F%3E%3C%2Fg%3E%3C%2Fsvg%3E\" alt=\"Ícone de Adicionar\">&nbsp; para criar um <strong>Novo Modelo</strong>.</p><p class=\"my-4\"><strong>Etapa 1: Configuração do Modelo</strong></p><p class=\"my-4\">Nesta primeira etapa, você definirá as características gerais do seu modelo. Preencha os seguintes campos:</p><ul><li><p class=\"my-4\"><strong>Nome do Modelo:</strong> Um nome claro e descritivo. Ex: \"Hipertrofia para Iniciantes - 3x Semana\".</p></li><li><p class=\"my-4\"><strong>Objetivo:</strong> Qual o foco principal do treino (Ganho de massa, Emagrecimento, etc.).</p></li><li><p class=\"my-4\"><strong>Dificuldade:</strong> O nível de intensidade (Baixa, Média, Alta).</p></li><li><p class=\"my-4\"><strong>Frequência:</strong> Quantos treinos serão realizados por semana. Isso definirá quantos treinos (A, B, C...) você irá configurar na próxima etapa.</p></li><li><p class=\"my-4\"><strong>Duração:</strong> Por quantas semanas esta rotina foi projetada para ser seguida.</p></li><li><p class=\"my-4\"><strong>Observações Gerais (Opcional):</strong> Adicione qualquer nota geral sobre o modelo que seja útil para você ou para o aluno.</p></li></ul><p class=\"my-4\">Após preencher tudo, clique em <strong>Avançar para Treinos</strong>.</p><p class=\"my-4\"><strong>Etapa 2: Definição dos Treinos</strong></p><p class=\"my-4\">Com base na frequência que você definiu, a plataforma criará os \"dias\" de treino (Treino A, Treino B, etc.). Nesta etapa, seu objetivo é definir os <strong>grupos musculares</strong> que serão trabalhados em cada um desses treinos.</p><ul><li><p class=\"my-4\">Clique nos grupos musculares disponíveis para adicioná-los a cada treino.</p></li><li><p class=\"my-4\">Para remover, basta clicar no grupo muscular já adicionado.</p></li><li><p class=\"my-4\">Você pode reordenar os treinos arrastando-os.</p></li></ul><p class=\"my-4\">Para avançar, é obrigatório que <strong>todos os treinos tenham pelo menos um grupo muscular</strong> definido.</p><p class=\"my-4\"><strong>Etapa 3: Adição de Exercícios</strong></p><p class=\"my-4\">Esta é a etapa final, onde você montará cada treino, adicionando os exercícios e configurando as séries.</p><ol><li><p class=\"my-4\"><strong>Adicionar Exercícios:</strong> Para cada treino, clique no botão para adicionar exercícios. Uma janela se abrirá, mostrando apenas os exercícios compatíveis com os grupos musculares que você definiu para aquele treino.</p></li><li><p class=\"my-4\"><strong>Configurar Séries:</strong> Após adicionar um exercício, configure as séries, repetições, carga e intervalos. Você pode adicionar quantas séries forem necessárias.</p></li><li><p class=\"my-4\"><strong>Tipos de Série:</strong> Você pode criar séries simples (um exercício por vez) ou séries combinadas (dois exercícios seguidos, ideal para Bi-Set e Superset).</p></li></ol><p class=\"my-4\">Para finalizar, é obrigatório que <strong>todos os treinos tenham pelo menos um exercício</strong> adicionado.</p><p class=\"my-4\">Ao clicar em <strong>Salvar Modelo</strong>, seu novo template estará pronto e disponível na sua lista de modelos para ser aplicado a qualquer um de seus alunos!</p>","category":"Rotinas de Treino (Criação)","user_type":"professor"}, 
 {"id":"5c38de14-79e4-4af5-8031-8a0aed43ff2d","title":"Como criar uma rotina a partir de um modelo?","content":"<p class=\"my-4\">Ao criar uma nova rotina para um aluno, escolha a opção <strong>Usar um Modelo</strong>. Você será levado a uma tela com todos os seus modelos salvos. Selecione o modelo desejado e a plataforma irá pré-preencher todas as etapas de criação da rotina (configuração, treinos e exercícios) com as informações do modelo. Você poderá então revisar e ajustar qualquer detalhe antes de finalizar e atribuir a rotina ao aluno.</p>","category":"Rotinas de Treino (Criação)","user_type":"professor"}, 
 {"id":"68c994ba-ea83-415e-906b-e46fb430cbc2","title":"Posso salvar uma rotina com Rascunho para continuar com a criação depois?","content":"<p class=\"my-4\">Sim. Durante o processo de criação de uma rotina, se você precisar parar e voltar depois, basta clicar em <strong>Cancelar</strong>. O sistema perguntará se você deseja <strong>Salvar como Rascunho</strong>. Ao salvar, a rotina ficará disponível na aba <strong>Rascunho</strong> na página de rotinas do aluno, pronta para você continuar a edição de onde parou.</p>","category":"Rotinas de Treino (Criação)","user_type":"professor"}, 
 {"id":"cbe2c501-d38e-440a-950e-302e713f1cee","title":"Por que o objetivo e a disponibilidade são definidos na rotina e não no perfil do aluno?","content":"<p class=\"my-4\">Esta é uma decisão de design para tornar o acompanhamento mais flexível e preciso. Os objetivos e a disponibilidade de um aluno podem mudar com o tempo (ex: um ciclo de <strong>Ganho de Massa</strong>&nbsp;seguido por um de <strong>Condicionamento</strong>). Ao atrelar essas informações à rotina, cada ciclo de treino se torna um registro histórico completo e autocontido. Se estivessem no perfil, a cada mudança, o histórico da fase anterior seria perdido. Essa abordagem garante um acompanhamento muito mais rico e detalhado da evolução do aluno a longo prazo.</p>","category":"Rotinas de Treino (Criação)","user_type":"ambos"}, 
 {"id":"32510957-d2a9-4154-8859-e2d86e960dc6","title":"Quais são as etapas no processo de criação de rotina?","content":"<p class=\"my-4\">O processo de criação de uma rotina é dividido em 3 etapas simples:</p><p class=\"my-4\"><strong>Configuração:</strong> Você define as informações gerais da rotina, como nome, objetivo, duração e frequência semanal.</p><p class=\"my-4\"><strong>Treinos</strong>: Você define os grupos musculares para cada dia de treino da semana (Ex: Treino A - Peito e Tríceps).</p><p class=\"my-4\"><strong>Exercícios</strong>: Você adiciona os exercícios para cada treino, configurando séries, repetições, carga e intervalos.</p><p class=\"my-4\">Seu progresso é salvo automaticamente a cada etapa.</p>","category":"Rotinas de Treino (Criação)","user_type":"professor"}, 
 {"id":"dffda372-fea3-45d9-a269-fef9964fb69e","title":"Por que meus treinos/exercícios são reiniciados ao alterar uma etapa anterior?","content":"<p class=\"my-4\">Ao criar ou editar uma rotina ou modelo, você pode notar que, ao voltar para uma etapa anterior e fazer uma alteração, os dados das etapas seguintes são reiniciados.</p><p class=\"my-4\"> Por exemplo, se você já definiu os exercícios (Etapa 3) e volta para alterar a frequência de treinos (Etapa 1), os exercícios podem ser zerados. Isso pode parecer estranho, mas é um comportamento intencional e crucial para garantir a <strong>consistência e a integridade</strong>&nbsp;da rotina que você está criando.&nbsp;O sistema funciona com uma lógica de <strong>cascata</strong>, onde as decisões tomadas em uma etapa afetam diretamente as opções e a estrutura das etapas seguintes.</p><p class=\"my-4\"><strong>Por que isso acontece?</strong></p><p class=\"my-4\">O objetivo é evitar a criação de rotinas com dados inconsistentes ou inválidos. Veja os cenários mais comuns:</p><p class=\"my-4\"><strong>Alterar a Frequência de Treinos (Etapa 1):</strong></p><p class=\"my-4\"><strong>Cenário</strong>: Você define uma rotina de 3 treinos por semana, monta os treinos A, B e C com seus respectivos exercícios. Depois, volta para a Etapa 1 e muda a frequência para 4 treinos por semana.<br><br><strong>O que acontece</strong>: O sistema precisa criar um novo <strong>Treino D</strong>, que ainda não tem grupos musculares ou exercícios definidos. Para manter a consistência, ele reinicia as etapas de treinos e exercícios, permitindo que você redefina a divisão semanal completa.</p><p class=\"my-4\">Alterar os Grupos Musculares (Etapa 2):</p><p class=\"my-4\"><strong>Cenário:</strong>&nbsp;Você define o <strong>Treino A</strong>&nbsp;como <strong>Peito e Tríceps</strong> e adiciona exercícios como Supino e Tríceps na Polia. Depois, volta para a Etapa 2 e muda os grupos musculares do <strong>Treino A</strong>&nbsp;para <strong>Costas e Bíceps</strong>\".</p><p class=\"my-4\"><strong>O que acontece</strong>: Os exercícios de peito e tríceps que você selecionou não são mais compatíveis com o novo foco do treino. Para evitar que um treino de costas tenha exercícios de peito, o sistema **reinicia apenas os exercícios do <strong>Treino A</strong>, preservando os exercícios dos outros treinos (B, C, etc.) que não foram alterados.</p><p class=\"my-4\">Essa lógica funciona como uma medida de segurança, garantindo que cada rotina criada seja coerente, bem estruturada e segura para o aluno, evitando erros que poderiam passar despercebidos.</p>","category":"Rotinas de Treino (Criação)","user_type":"professor"}, 
 {"id":"c3d16511-c71e-410d-be3a-bdb1509a9b06","title":"Como organizo a ordem dos treinos e exercícios?","content":"<h3><strong>Organizando a Sequência do seu Plano de Treino</strong></h3><p class=\"my-4\">A ordem em que os treinos e os exercícios são apresentados é fundamental para a progressão do aluno. Nossa plataforma oferece uma maneira simples de organizar essa sequência durante a criação de uma rotina ou modelo.</p><p class=\"my-4\"><strong>Reordenando os Treinos (Etapa 2)</strong><br><br><strong>Na Etapa 2</strong>, onde você define os grupos musculares para cada treino da semana, você verá setas para cima <img class=\"inline-block h-[1.2em] w-auto -translate-y-px\" src=\"data:image/svg+xml,%3Csvg%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%20width%3D%2232%22%20height%3D%2232%22%20viewBox%3D%220%200%2032%2032%22%3E%3Ccircle%20cx%3D%2216%22%20cy%3D%2216%22%20r%3D%2216%22%20fill%3D%22%23f3f4f6%22%2F%3E%3Cg%20transform%3D%22translate(4%2C%204)%22%20stroke%3D%22currentColor%22%20stroke-width%3D%222%22%20stroke-linecap%3D%22round%22%20stroke-linejoin%3D%22round%22%20fill%3D%22none%22%3E%3Cpath%20d%3D%22m18%2015-6-6-6%206%22%2F%3E%3C%2Fg%3E%3C%2Fsvg%3E\" alt=\"Ícone Seta para Cima\">e para baixo&nbsp;<img class=\"inline-block h-[1.2em] w-auto -translate-y-px\" src=\"data:image/svg+xml,%3Csvg%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%20width%3D%2232%22%20height%3D%2232%22%20viewBox%3D%220%200%2032%2032%22%3E%3Ccircle%20cx%3D%2216%22%20cy%3D%2216%22%20r%3D%2216%22%20fill%3D%22%23f3f4f6%22%2F%3E%3Cg%20transform%3D%22translate(4%2C%204)%22%20stroke%3D%22currentColor%22%20stroke-width%3D%222%22%20stroke-linecap%3D%22round%22%20stroke-linejoin%3D%22round%22%20fill%3D%22none%22%3E%3Cpath%20d%3D%22m6%209%206%206%206-6%22%2F%3E%3C%2Fg%3E%3C%2Fsvg%3E\" alt=\"Ícone Seta para Baixo\"> ao lado do nome de cada treino (Treino A, Treino B, etc.).</p><p class=\"my-4\"><strong>Como funciona:</strong>&nbsp;Clique nas setas para mover um treino para cima ou para baixo na lista.</p><p class=\"my-4\"><strong>O que acontece:</strong>&nbsp;Ao reordenar, o sistema automaticamente renomeia os treinos para manter a sequência lógica (A, B, C...). Por exemplo, se você mover o<strong> Treino C</strong> para a segunda posição, ele se tornará o novo <strong>Treino B.</strong></p><p class=\"my-4\"><strong>Reordenando os Exercícios (Etapa 3)</strong></p><p class=\"my-4\"><strong>Etapa 3</strong>, dentro de cada card de treino, você encontrará as mesmas setas para cima <img class=\"inline-block h-[1.2em] w-auto -translate-y-px\" src=\"data:image/svg+xml,%3Csvg%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%20width%3D%2232%22%20height%3D%2232%22%20viewBox%3D%220%200%2032%2032%22%3E%3Ccircle%20cx%3D%2216%22%20cy%3D%2216%22%20r%3D%2216%22%20fill%3D%22%23f3f4f6%22%2F%3E%3Cg%20transform%3D%22translate(4%2C%204)%22%20stroke%3D%22currentColor%22%20stroke-width%3D%222%22%20stroke-linecap%3D%22round%22%20stroke-linejoin%3D%22round%22%20fill%3D%22none%22%3E%3Cpath%20d%3D%22m18%2015-6-6-6%206%22%2F%3E%3C%2Fg%3E%3C%2Fsvg%3E\" alt=\"Ícone Seta para Cima\">&nbsp;e para baixo <img class=\"inline-block h-[1.2em] w-auto -translate-y-px\" src=\"data:image/svg+xml,%3Csvg%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%20width%3D%2232%22%20height%3D%2232%22%20viewBox%3D%220%200%2032%2032%22%3E%3Ccircle%20cx%3D%2216%22%20cy%3D%2216%22%20r%3D%2216%22%20fill%3D%22%23f3f4f6%22%2F%3E%3Cg%20transform%3D%22translate(4%2C%204)%22%20stroke%3D%22currentColor%22%20stroke-width%3D%222%22%20stroke-linecap%3D%22round%22%20stroke-linejoin%3D%22round%22%20fill%3D%22none%22%3E%3Cpath%20d%3D%22m6%209%206%206%206-6%22%2F%3E%3C%2Fg%3E%3C%2Fsvg%3E\" alt=\"Ícone Seta para Baixo\">&nbsp;ao lado de cada exercício que você adicionou.</p><p class=\"my-4\"><strong>Como funciona:</strong>&nbsp;Use as setas para ajustar a ordem dos exercícios dentro daquele treino específico.</p><p class=\"my-4\"><strong>Importância:</strong>&nbsp;Isso permite que você defina a sequência exata de execução, por exemplo, começando com exercícios compostos e finalizando com isolados.</p><p class=\"my-4\">Essa funcionalidade garante que você tenha controle total sobre a estrutura e a progressão do plano de treino, de forma rápida e intuitiva.</p>","category":"Rotinas de Treino (Criação)","user_type":"professor"}, 
 {"id":"e7e07f21-a796-49ad-b06f-b7db1f5fbb8e","title":" O que são e como configurar Série Simples e Série Combinada?","content":"<p class=\"my-4\">Ao montar um treino em nossa plataforma, você tem a flexibilidade de usar diferentes métodos para estruturar as séries. Os dois métodos principais são a <strong>Série Simples</strong> e a <strong>Série Combinada</strong>.</p><p class=\"my-4\"><strong>Série Simples</strong></p><p class=\"my-4\">É o método tradicional, onde o aluno executa todas as séries de um único exercício antes de passar para o próximo.</p><p class=\"my-4\"><strong>Série Combinada (Bi-Set e Super-Set)</strong></p><p class=\"my-4\">É um método de alta intensidade que agrupa dois exercícios para serem executados em sequência, com pouco ou nenhum descanso entre eles.</p><p class=\"my-4\"></p><p class=\"my-4\"></p>","category":"Rotinas de Treino (Criação)","user_type":"professor"}, 
 {"id":"803fd924-1747-4a95-af6e-7bcb7bcc7460","title":"O que é e como configuro um Drop Set?","content":"<p class=\"my-4\">Drop Set é uma técnica de alta intensidade onde, após completar as repetições de uma série, o aluno imediatamente reduz a carga e continua a executar o mesmo exercício até a falha. Em nossa plataforma, você pode adicionar um Drop Set a qualquer <strong>Série Simples</strong>. Ao configurar a série, marque a opção <strong>Adicionar Drop Set</strong>&nbsp;e informe qual será a carga reduzida. Durante a execução, o aluno será instruído a realizar a série principal e em seguida, fazer o drop até a falha, sem descanso.</p>","category":"Rotinas de Treino (Criação)","user_type":"professor"}, 
 {"id":"9a0d7671-889c-4f5d-a9d3-dd84edd5f327","title":"Como adiciono exercícios aos meus treinos?","content":"<p class=\"my-4\">Para adicionar exercícios, utilizamos um sistema de <strong>Sacola de Exercícios</strong>. Pense nela como um carrinho de compras: você seleciona todos os exercícios que deseja e, no final, adiciona tudo ao treino de uma só vez.</p><p class=\"my-4\">Ao clicar no botão para adicionar exercícios&nbsp;<img class=\"inline-block h-[1.2em] w-auto -translate-y-px\" src=\"data:image/svg+xml,%3Csvg%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%20width%3D%2232%22%20height%3D%2232%22%20viewBox%3D%220%200%2032%2032%22%3E%3Ccircle%20cx%3D%2216%22%20cy%3D%2216%22%20r%3D%2216%22%20fill%3D%22%23f3f4f6%22%2F%3E%3Cg%20transform%3D%22translate(4%2C%204)%22%20stroke%3D%22currentColor%22%20stroke-width%3D%222%22%20stroke-linecap%3D%22round%22%20stroke-linejoin%3D%22round%22%20fill%3D%22none%22%3E%3Cpath%20d%3D%22M5%2012h14%22%2F%3E%3Cpath%20d%3D%22M12%205v14%22%2F%3E%3C%2Fg%3E%3C%2Fsvg%3E\" alt=\"Ícone de Adicionar\"><code>&nbsp;</code>em um treino, o seletor de exercícios será aberto. Nele, você pode escolher entre adicionar uma <strong>Série Simples</strong> ou uma <strong>Série Combinada</strong>.</p><p class=\"my-4\"><strong>1. Adicionando uma Série Simples</strong></p><p class=\"my-4\">Este é o modo padrão, ideal para exercícios executados de forma isolada.</p><ol><li><p class=\"my-4\">Certifique-se de que o modo <strong>Série Simples</strong> está ativo.</p></li><li><p class=\"my-4\">Navegue pela biblioteca e clique nos exercícios que deseja adicionar. Cada exercício selecionado irá diretamente para a sua sacola.</p></li><li><p class=\"my-4\">Você pode adicionar quantos exercícios quiser.</p></li></ol><p class=\"my-4\"><strong>2. Adicionando uma Série Combinada (Bi-set/Superset)</strong></p><p class=\"my-4\">Para criar uma série onde dois exercícios são executados em sequência:</p><ol><li><p class=\"my-4\">Primeiro, clique no botão <strong>Série Combinada</strong> no topo do seletor.</p></li><li><p class=\"my-4\">Selecione o <strong>primeiro exercício</strong> da combinação. Ele será adicionado à sacola como uma \"combinação incompleta\".</p></li><li><p class=\"my-4\">Selecione o <strong>segundo exercício</strong>. Isso completará a combinação na sacola.</p></li><li><p class=\"my-4\">Para criar outra série combinada, basta repetir o processo selecionando mais dois exercícios.</p></li></ol><p class=\"my-4\"><strong>3. Gerenciando sua Sacola</strong></p><p class=\"my-4\">A qualquer momento, você pode clicar na aba <strong>Sacola</strong> para visualizar, organizar ou remover os itens que selecionou.</p><ul><li><p class=\"my-4\"><strong>Itens Simples:</strong> Aparecerão individualmente.</p></li><li><p class=\"my-4\"><strong>Itens Combinados:</strong> Aparecerão como um par.</p></li><li><p class=\"my-4\"><strong>Combinação Incompleta:</strong> Se você selecionou apenas um exercício no modo \"Série Combinada\", ele ficará pendente até que você selecione o segundo ou mude para o modo \"Série Simples\" (o que o descartará).</p></li></ul><p class=\"my-4\">4. Finalizando a Adição</p><p class=\"my-4\">Quando sua sacola estiver com todos os exercícios e séries que você deseja para aquele treino, clique no botão <strong>Concluir</strong>. Todos os itens da sacola serão adicionados ao seu treino de uma só vez, e o modal será fechado.</p><p class=\"my-4\">Este sistema foi projetado para otimizar seu tempo, permitindo que você monte blocos inteiros de treino de forma muito mais eficiente.</p><p class=\"my-4\"></p>","category":"Rotinas de Treino (Criação)","user_type":"professor"}, 
 {"id":"8a4ef587-6a26-4c72-b767-06e3dced19cd","title":"Como a Meta é exibida para o aluno durante o treino?","content":"<p class=\"my-4\">O campo <strong>Meta</strong> na tela de execução do aluno mostra o objetivo de repetições e carga que você definiu. A exibição se adapta da seguinte forma:<br><br><strong>Repetições e Carga definidas (ex: 12 reps, 20kg):</strong> Aparecerá como <strong>Meta: 12 x 20kg</strong>.</p><p class=\"my-4\"><strong>Apenas Repetições definidas (ex: 12 reps, 0kg):</strong> Aparecerá como <strong>Meta: 12 repetições</strong>. Ideal para exercícios com peso corporal.</p><p class=\"my-4\"><strong>Repetições zeradas ou em branco:</strong>&nbsp;O campo <strong>Meta</strong> não será exibido. Use esta opção para dar liberdade ao aluno, permitindo que ele decida e registre as repetições e a carga que conseguiu executar na hora do treino.</p>","category":"Rotinas de Treino (Criação)","user_type":"professor"}, 
 {"id":"5f1156cc-5947-4cf4-ab0e-8782af0b5ca3","title":"O que são intervalos e como configurá-los?","content":"<p class=\"my-4\">Ao criar um exercício na rotina, você pode configurar <strong>dois tipos de intervalo</strong>:</p><p class=\"my-4\"><strong>Intervalo entre Séries</strong>: É o tempo de descanso que o aluno terá entre uma série e outra do mesmo exercício. Por exemplo, se você definir 60 segundos, após completar a 1ª série, o aluno terá 1 minuto de descanso antes de iniciar a 2ª série.</p><p class=\"my-4\"><strong>Intervalo entre Exercícios</strong>: É o tempo de descanso após completar todas as séries de um exercício, antes de passar para o próximo exercício. Este intervalo é útil quando o aluno precisa trocar de equipamento ou se preparar para um movimento diferente.</p><p class=\"my-4\"><strong>Dica prática:</strong> Para exercícios de força com cargas pesadas, intervalos maiores (90-120s) permitem melhor recuperação. Para treinos de resistência ou circuitos, intervalos menores (30-45s) mantêm a intensidade.</p>","category":"Rotinas de Treino (Criação)","user_type":"professor"}, 
 {"id":"8e194e03-6525-4ec9-bec2-53eb70c51bb2","title":"Como configuro exercícios com peso corporal?","content":"<p class=\"my-4\">Alguns exercícios utilizam apenas o peso do próprio corpo do aluno, como flexões, barras, abdominais e agachamentos livres. Para esses exercícios, você pode marcar a opção <strong>\"Peso Corporal\"</strong> durante a configuração.</p><p class=\"my-4\"><strong>O que acontece quando marco Peso Corporal?</strong></p><ul class=\"list-disc pl-6 my-4\"><li>O campo de carga (kg) é desabilitado, pois não faz sentido definir uma carga externa</li><li>Durante a execução, o aluno não precisará informar a carga utilizada</li><li>O registro focará apenas no número de repetições realizadas</li></ul><p class=\"my-4\"><strong>Quando usar:</strong> Sempre que o exercício não utilizar equipamentos com carga adicional (halteres, barras, anilhas, cabos, etc.).</p><p class=\"my-4\"><strong>Dica:</strong> Mesmo exercícios com peso corporal podem ter progressão! O aluno pode aumentar o número de repetições ou séries ao longo do tempo.</p>","category":"Rotinas de Treino (Criação)","user_type":"professor"}, 
 {"id":"f4a4d672-b5b1-4f00-98e7-78fbe1c86a32","title":"Qual a diferença entre Bloquear e Excluir uma rotina de treino?","content":"<p class=\"my-4\"><span style=\"color: rgb(97, 97, 97);\">A função de bloqueio de rotina é uma ferramenta administrativa poderosa para gerenciar o acesso dos seus alunos aos treinos. Diferente de excluir, o bloqueio é uma suspensão temporária que mantém todo o histórico intacto.</span></p>","category":"Rotinas de Treino (Execução)","user_type":"ambos"}, 
 {"id":"e3132697-4e55-4c80-9b7b-305c8c836c8b","title":"Quando o professor deve Bloquear uma rotina de treino?","content":"<p class=\"my-4\">O bloqueio é ideal para situações temporárias. Os cenários mais comuns são:</p><ul><li><p class=\"my-4\"><strong>Falta de Pagamento:</strong> Se um aluno está com o pagamento pendente, você pode bloquear o acesso à rotina como um lembrete administrativo até que a situação seja regularizada.</p></li><li><p class=\"my-4\"><strong>Pausa ou Licença do Aluno:</strong> Caso o aluno precise se afastar dos treinos por motivos de saúde (licença médica), férias ou qualquer outro motivo pessoal, o bloqueio garante que ele não execute os treinos sem sua supervisão ou fora do período planejado.</p></li><li><p class=\"my-4\"><strong>Ajustes no Planejamento:</strong> Se você está realizando uma revisão completa no treino do aluno e não quer que ele execute a versão antiga enquanto você trabalha na nova.</p></li></ul><p class=\"my-4\"></p>","category":"Rotinas de Treino (Execução)","user_type":"professor"}, 
 {"id":"5d9f8743-db52-43ff-9db7-0b6de40a13cf","title":"Qual a diferença entre Modo Aluno e Modo Assistido na execução do treino?","content":"<p class=\"my-4\">A plataforma oferece duas formas de registrar uma sessão de treino:</p><p class=\"my-4\"><strong>Modo Aluno:</strong> É o modo padrão, onde o próprio aluno acessa o aplicativo e registra suas séries, repetições e cargas. Ideal para consultorias online ou quando o aluno treina sozinho.</p><p class=\"my-4\"><strong>Modo Assistido:</strong>&nbsp;Ocorre quando o professor, logado em sua própria conta, inicia e registra o treino para o aluno. É perfeito para sessões de personal training presenciais, garantindo que o professor tenha controle total sobre os dados registrados.</p><p class=\"my-4\">Ambos os modos atualizam o progresso da rotina do aluno, e o histórico indica quem realizou o registro.</p>","category":"Rotinas de Treino (Execução)","user_type":"ambos"}, 
 {"id":"3c637b0c-304f-45b9-af74-1a306d44465c","title":"Onde encontro a lista de sessões disponíveis da atual rotina de treino?","content":"<p class=\"my-4\">Primeiro você precisa acessar a tela de seleção de sessões da sua rotina ativa. O caminho é um pouco diferente para professores e alunos.</p><p class=\"my-4\"><strong>Para Alunos:</strong></p><ol><li><p class=\"my-4\">No menu principal, vá para <strong>Rotinas</strong>.</p></li><li><p class=\"my-4\">Na aba <strong>Atual</strong> selecione a rotina com o status <strong>Ativa</strong>, clique no botão de opções <img class=\"inline-block h-[1.2em] w-auto -translate-y-px\" src=\"data:image/svg+xml,%3Csvg%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%20width%3D%2232%22%20height%3D%2232%22%20viewBox%3D%220%200%2032%2032%22%3E%3Ccircle%20cx%3D%2216%22%20cy%3D%2216%22%20r%3D%2216%22%20fill%3D%22%23f3f4f6%22%2F%3E%3Cg%20transform%3D%22translate(4%2C%204)%22%20stroke%3D%22currentColor%22%20stroke-width%3D%222%22%20stroke-linecap%3D%22round%22%20stroke-linejoin%3D%22round%22%20fill%3D%22none%22%3E%3Ccircle%20cx%3D%2212%22%20cy%3D%2212%22%20r%3D%221%22%2F%3E%3Ccircle%20cx%3D%2212%22%20cy%3D%225%22%20r%3D%221%22%2F%3E%3Ccircle%20cx%3D%2212%22%20cy%3D%2219%22%20r%3D%221%22%2F%3E%3C%2Fg%3E%3C%2Fsvg%3E\" alt=\"Ícone de Menu\">&nbsp;e selecione&nbsp;<strong>Treinar</strong>&nbsp;</p></li><li><p class=\"my-4\">Você será levado à tela com a lista de todas as sessões de treino disponíveis para a rotina.</p></li></ol><p class=\"my-4\"><strong>Para Professores:</strong></p><p class=\"my-4\">Você pode iniciar um treino para um aluno (no Modo Assistido) de duas maneiras:</p><ol><li><p class=\"my-4\"><strong>Pela página Alunos:</strong></p><ul><li><p class=\"my-4\">No menu principal, vá para <strong>Alunos</strong>.</p></li><li><p class=\"my-4\">No card do aluno clique no botão de opções&nbsp;<img class=\"inline-block h-[1.2em] w-auto -translate-y-px\" src=\"data:image/svg+xml,%3Csvg%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%20width%3D%2232%22%20height%3D%2232%22%20viewBox%3D%220%200%2032%2032%22%3E%3Ccircle%20cx%3D%2216%22%20cy%3D%2216%22%20r%3D%2216%22%20fill%3D%22%23f3f4f6%22%2F%3E%3Cg%20transform%3D%22translate(4%2C%204)%22%20stroke%3D%22currentColor%22%20stroke-width%3D%222%22%20stroke-linecap%3D%22round%22%20stroke-linejoin%3D%22round%22%20fill%3D%22none%22%3E%3Ccircle%20cx%3D%2212%22%20cy%3D%2212%22%20r%3D%221%22%2F%3E%3Ccircle%20cx%3D%2212%22%20cy%3D%225%22%20r%3D%221%22%2F%3E%3Ccircle%20cx%3D%2212%22%20cy%3D%2219%22%20r%3D%221%22%2F%3E%3C%2Fg%3E%3C%2Fsvg%3E\" alt=\"Ícone de Menu\"> para a seção de <strong>Rotinas</strong>.</p></li><li><p class=\"my-4\">Na aba <strong>Atual</strong>&nbsp;selecione o card da rotina <strong>Ativa</strong>, clique no botão de opções&nbsp;<img class=\"inline-block h-[1.2em] w-auto -translate-y-px\" src=\"data:image/svg+xml,%3Csvg%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%20width%3D%2232%22%20height%3D%2232%22%20viewBox%3D%220%200%2032%2032%22%3E%3Ccircle%20cx%3D%2216%22%20cy%3D%2216%22%20r%3D%2216%22%20fill%3D%22%23f3f4f6%22%2F%3E%3Cg%20transform%3D%22translate(4%2C%204)%22%20stroke%3D%22currentColor%22%20stroke-width%3D%222%22%20stroke-linecap%3D%22round%22%20stroke-linejoin%3D%22round%22%20fill%3D%22none%22%3E%3Ccircle%20cx%3D%2212%22%20cy%3D%2212%22%20r%3D%221%22%2F%3E%3Ccircle%20cx%3D%2212%22%20cy%3D%225%22%20r%3D%221%22%2F%3E%3Ccircle%20cx%3D%2212%22%20cy%3D%2219%22%20r%3D%221%22%2F%3E%3C%2Fg%3E%3C%2Fsvg%3E\" alt=\"Ícone de Menu\"> e selecione <strong>Treinar</strong>.</p></li></ul></li><li><p class=\"my-4\"><strong>Pela página Rotinas:</strong></p><ul><li><p class=\"my-4\">No menu principal, vá para <strong>Rotinas</strong>.</p></li><li><p class=\"my-4\">Na aba <strong>Atual</strong> encontre o aluno e a rotina desejada, clique no menu de opções <img class=\"inline-block h-[1.2em] w-auto -translate-y-px\" src=\"data:image/svg+xml,%3Csvg%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%20width%3D%2232%22%20height%3D%2232%22%20viewBox%3D%220%200%2032%2032%22%3E%3Ccircle%20cx%3D%2216%22%20cy%3D%2216%22%20r%3D%2216%22%20fill%3D%22%23f3f4f6%22%2F%3E%3Cg%20transform%3D%22translate(4%2C%204)%22%20stroke%3D%22currentColor%22%20stroke-width%3D%222%22%20stroke-linecap%3D%22round%22%20stroke-linejoin%3D%22round%22%20fill%3D%22none%22%3E%3Ccircle%20cx%3D%2212%22%20cy%3D%2212%22%20r%3D%221%22%2F%3E%3Ccircle%20cx%3D%2212%22%20cy%3D%225%22%20r%3D%221%22%2F%3E%3Ccircle%20cx%3D%2212%22%20cy%3D%2219%22%20r%3D%221%22%2F%3E%3C%2Fg%3E%3C%2Fsvg%3E\" alt=\"Ícone de Menu\">&nbsp;e selecione <strong>Treinar</strong>.</p></li></ul></li></ol><p class=\"my-4\">Após seguir um desses caminhos, você chegará à tela de seleção de sessões, onde poderá escolher qual treino do dia executar.</p><p class=\"my-4\"><br></p>","category":"Rotinas de Treino (Execução)","user_type":"ambos"}, 
 {"id":"9bee2efb-bd62-4b12-9d24-55960c41d322","title":" Como o sistema sugere a próxima sessão de treino?","content":"<p class=\"my-4\">Ao acessar a tela de seleção de treinos de uma rotina, a plataforma foi projetada para guiar você de forma inteligente, sugerindo a próxima sessão mais lógica a ser executada. No entanto, você sempre terá flexibilidade para escolher um treino diferente, se desejar.</p><p class=\"my-4\">A sugestão segue uma ordem de prioridade clara:</p><p class=\"my-4\"><strong>Prioridade 1: Continuar uma Sessão Pausada</strong></p><p class=\"my-4\">Se você iniciou um treino e precisou interrompê-lo usando o botão <strong>Pausar</strong>, essa sessão ficará com o status <strong>Pausada</strong>.</p><ul><li><p class=\"my-4\">Ao retornar à tela de seleção, o sistema <strong>sempre</strong> dará prioridade a esta sessão.</p></li><li><p class=\"my-4\">O botão correspondente mudará para <strong>Continuar</strong>, incentivando você a retomar o treino de onde parou.</p></li></ul><p class=\"my-4\"><strong>Prioridade 2: A Próxima Sessão na Sequência</strong></p><p class=\"my-4\">Se não houver nenhuma sessão pausada, o sistema irá sugerir a próxima sessão que ainda não foi concluída, seguindo a ordem numérica (Sessão 1, Sessão 2, etc.).</p><ul><li><p class=\"my-4\">Ele encontrará a primeira sessão com o status <strong>Em Aberto&nbsp;</strong>e a apresentará como a próxima a ser feita.</p></li></ul><p class=\"my-4\"><strong>Posso treinar fora de ordem?</strong></p><p class=\"my-4\"><strong>Sim!</strong> Você tem total liberdade para escolher qualquer sessão que não esteja marcada como <strong>Concluída</strong>.</p><p class=\"my-4\">Por exemplo, se o sistema sugere a <strong>Sessão 3</strong>, mas você prefere fazer a <strong>Sessão 4</strong>&nbsp;naquele dia, basta clicar no botão <strong>Treinar</strong> da <strong>Sessão 4</strong>.</p><p class=\"my-4\"><strong>O que acontece se eu pular uma sessão?</strong></p><p class=\"my-4\">Se você pular uma sessão (por exemplo, fizer a 4 antes da 3), a <strong>Sessão 3</strong>&nbsp;continuará com o status <strong>Em Aberto</strong>.</p><p class=\"my-4\">Na próxima vez que você acessar a tela de seleção, o sistema voltará a sugerir a <strong>Sessão 3</strong>, pois ela ainda é a primeira sessão não concluída na sequência. A plataforma sempre tentará guiá-lo para completar a rotina na ordem planejada.</p>","category":"Rotinas de Treino (Execução)","user_type":"ambos"}, 
 {"id":"6a83050e-65b4-4b36-9081-f4f4a6803d3e","title":"O que temos na tela de execução do treino?","content":"<h3><strong>Entendendo a Tela de Execução de Treino</strong><br></h3><p class=\"my-4\">A tela de execução é o seu ambiente de treino digital. Ela foi projetada para ser simples e eficiente, permitindo que você se concentre no seu exercício enquanto registra seu progresso.</p><p class=\"my-4\"><strong>1. Cronômetro Geral</strong></p><p class=\"my-4\">No topo da tela, um cronômetro geral marca o tempo total da sua sessão de treino, começando a contar assim que você entra na tela.</p><p class=\"my-4\"><strong>2. Registrando Cada Série</strong></p><p class=\"my-4\">Para cada exercício, você encontrará cards para registrar suas séries.</p><p class=\"my-4\"><strong>Série Simples:</strong> Insira o número de repetições e a carga (em kg) que você realizou.</p><p class=\"my-4\"><strong>Série Combinada (Bi-Set ou Superset):</strong>&nbsp;Você terá campos para registrar as repetições e cargas para os dois exercícios da série.</p><p class=\"my-4\">Ao clicar em <strong>Finalizar Série</strong>, a série é marcada como concluída e o sistema automaticamente inicia o cronômetro de intervalo para o seu descanso.</p><p class=\"my-4\"><strong>3. Cronômetros de Intervalo</strong></p><p class=\"my-4\">Após finalizar uma série, um modal de cronômetro aparecerá:</p><p class=\"my-4\"><strong>Intervalo entre Séries</strong>: Um contador regressivo para o seu descanso antes da próxima série do mesmo exercício.</p><p class=\"my-4\"><strong>Intervalo entre Exercícios:</strong>&nbsp;Ao finalizar a última série de um exercício, um cronômetro maior aparecerá, mostrando o tempo de descanso e qual será o próximo exercício a ser executado.</p><p class=\"my-4\"><strong>&nbsp;4. Ações e Informações Adicionais</strong></p><p class=\"my-4\">Ao lado de cada exercício, você encontrará ícones úteis:</p><p class=\"my-4\"><strong>Histórico</strong> <img class=\"inline-block h-[1.2em] w-auto -translate-y-px\" src=\"data:image/svg+xml,%3Csvg%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%20width%3D%2232%22%20height%3D%2232%22%20viewBox%3D%220%200%2032%2032%22%3E%3Ccircle%20cx%3D%2216%22%20cy%3D%2216%22%20r%3D%2216%22%20fill%3D%22%23f3f4f6%22%2F%3E%3Cg%20transform%3D%22translate(4%2C%204)%22%20stroke%3D%22currentColor%22%20stroke-width%3D%222%22%20stroke-linecap%3D%22round%22%20stroke-linejoin%3D%22round%22%20fill%3D%22none%22%3E%3Cpath%20d%3D%22M3%2012a9%209%200%201%200%209-9%209.75%209.75%200%200%200-6.74%202.74L3%208%22%2F%3E%3Cpath%20d%3D%22M3%203v5h5%22%2F%3E%3C%2Fg%3E%3C%2Fsvg%3E\" alt=\"Ícone de Histórico\">: Permite ver seu histórico de cargas e repetições para aquele exercício específico em treinos anteriores.</p><p class=\"my-4\"><strong>Detalhes</strong>&nbsp;<img class=\"inline-block h-[1.2em] w-auto -translate-y-px\" src=\"data:image/svg+xml,%3Csvg%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%20width%3D%2232%22%20height%3D%2232%22%20viewBox%3D%220%200%2032%2032%22%3E%3Ccircle%20cx%3D%2216%22%20cy%3D%2216%22%20r%3D%2216%22%20fill%3D%22%23f3f4f6%22%2F%3E%3Cg%20transform%3D%22translate(4%2C%204)%22%20stroke%3D%22currentColor%22%20stroke-width%3D%222%22%20stroke-linecap%3D%22round%22%20stroke-linejoin%3D%22round%22%20fill%3D%22none%22%3E%3Ccircle%20cx%3D%2212%22%20cy%3D%2212%22%20r%3D%2210%22%2F%3E%3Cpath%20d%3D%22M12%2016v-4%22%2F%3E%3Cpath%20d%3D%22M12%208h.01%22%2F%3E%3C%2Fg%3E%3C%2Fsvg%3E\" alt=\"Ícone de Informação\">: Abre um modal com as instruções de execução, fotos e vídeos do exercício.</p><p class=\"my-4\"><strong>5. Pausar e Finalizar</strong></p><p class=\"my-4\">Na parte inferior da tela, você tem dois botões principais:<br><br><strong>Pausar:</strong>&nbsp;Se precisar interromper o treino, use este botão. Seu progresso será salvo e você poderá continuar mais tarde. A sessão ficará com o status <strong>Pausada</strong>.</p><p class=\"my-4\"><strong>Finalizar:</strong>&nbsp;Ao concluir todos os exercícios, clique aqui para encerrar a sessão. O sistema salvará todos os dados e marcará o treino como <strong>Concluído</strong>.</p>","category":"Rotinas de Treino (Execução)","user_type":"ambos"}, 
 {"id":"a0f8a60e-cacd-499b-99de-69ad90ecc816","title":"Como Pausar e Retomar uma Sessão de Treino?","content":"<p class=\"my-4\">A função <strong>Pausar</strong> foi criada para te dar flexibilidade. Se você precisar atender uma ligação, ajudar alguém na academia ou simplesmente fazer uma pausa mais longa que o normal, pode usar esta função sem medo de perder seu progresso.</p><p class=\"my-4\">Ao pausar uma sessão:</p><ul><li><p class=\"my-4\">Todo o seu progresso (séries, repetições, cargas e observações) é salvo.</p></li><li><p class=\"my-4\">O cronômetro geral do treino é interrompido e seu tempo decorrido é guardado.</p></li><li><p class=\"my-4\">A sessão fica com o status <strong>Pausada&nbsp;</strong>na sua lista de treinos, esperando por você.</p></li></ul><p class=\"my-4\"><strong>Como Pausar uma Sessão de Treino</strong></p><ol><li><p class=\"my-4\">Na tela de execução do treino, localize o botão <strong>Pausar</strong> na parte inferior.</p></li><li><p class=\"my-4\">Ao clicar, uma janela de confirmação aparecerá para garantir que você não saia acidentalmente.</p></li><li><p class=\"my-4\">Confirme a ação. Você será redirecionado para a tela de seleção de treinos da sua rotina.</p></li></ol><p class=\"my-4\"><strong>Como Retomar uma Sessão Pausada</strong></p><p class=\"my-4\">Retomar seu treino é tão simples quanto pausá-lo:</p><ol><li><p class=\"my-4\">Acesse a rotina que você estava executando.</p></li><li><p class=\"my-4\">Na lista de sessões de treino, você verá que a sessão que você pausou agora tem o status <strong>Pausada&nbsp;</strong>e o botão principal mudou para <strong>Continuar</strong>.</p></li><li><p class=\"my-4\">Clique em <strong>Continuar</strong>.</p></li><li><p class=\"my-4\">Você será levado de volta para a tela de execução, exatamente do ponto onde parou, com todo o seu progresso e o tempo do cronômetro restaurados.</p></li></ol><p class=\"my-4\">Essa funcionalidade garante que, não importa o que aconteça, seu treino e seu esforço estarão sempre salvos e prontos para quando você voltar.</p>","category":"Rotinas de Treino (Execução)","user_type":"ambos"}, 
 {"id":"fe3c6f7e-f044-4815-846e-d5d0935c8306","title":"Qual a diferença entre Série Simples e Série Combinada?","content":"<p class=\"my-4\">Em seus treinos na plataforma, você encontrará dois tipos principais de séries. Entender a diferença entre elas é fundamental para executar seu treino corretamente e alcançar seus objetivos.</p><p class=\"my-4\"><strong>Série Simples</strong></p><p class=\"my-4\">Este é o método tradicional de treino. Nele, você executa todas as séries de um único exercício antes de passar para o próximo.</p><ul><li><p class=\"my-4\"><strong>Exemplo:</strong> Você faz 3 séries de Supino Reto, com os devidos intervalos, e só depois de concluí-las, avança para o próximo exercício da sua lista.</p></li></ul><p class=\"my-4\"><strong>Série Combinada</strong></p><p class=\"my-4\">Este é um método de treino mais intenso que agrupa dois exercícios para serem executados em sequência, com pouco ou nenhum descanso entre eles. O descanso só acontece após a conclusão dos dois exercícios.</p><p class=\"my-4\">Na plataforma, as séries combinadas podem ser usadas para criar:</p><ul><li><p class=\"my-4\"><strong>Bi-Set:</strong> Dois exercícios para o <strong>mesmo grupo muscular</strong>, executados em sequência para levar o músculo à fadiga.</p><ul><li><p class=\"my-4\"><em>Exemplo:</em> Rosca Direta + Rosca Martelo para bíceps.</p></li></ul></li><li><p class=\"my-4\"><strong>Super-Set (ou Super-série):</strong> Dois exercícios para <strong>grupos musculares opostos</strong> (antagonistas), permitindo que um descanse enquanto o outro trabalha.</p><ul><li><p class=\"my-4\"><em>Exemplo:</em> Rosca Direta (bíceps) + Extensão de Tríceps (tríceps).</p></li></ul></li></ul><p class=\"my-4\">Essa técnica é excelente para aumentar a intensidade, otimizar o tempo de treino e gerar novos estímulos para o seu corpo. Siga sempre a ordem e os intervalos definidos pelo seu professor!</p>","category":"Rotinas de Treino (Execução)","user_type":"ambos"}, 
 {"id":"6db3fd31-b438-4e4e-85d7-764d3e426f67","title":"O que é um Drop Set?","content":"<p class=\"my-4\">Você já viu a indicação <strong>Drop Set</strong> em alguma série do seu treino e ficou na dúvida sobre o que fazer? Fique tranquilo, vamos explicar!</p><p class=\"my-4\">O <strong>Drop Set</strong> é uma técnica de treinamento avançada que seu professor pode adicionar a uma série para aumentar a intensidade e levar seus músculos a um novo nível de estímulo.</p><p class=\"my-4\">Como funciona um Drop Set no aplicativo?</p><p class=\"my-4\">A execução é dividida em duas partes, feitas sem descanso entre elas:</p><ol><li><p class=\"my-4\"><strong>Série Padrão:</strong> Primeiro, você executa a série normalmente, com a carga e o número de repetições definidos pelo seu professor (por exemplo, 10 repetições com 50kg).</p></li><li><p class=\"my-4\"><strong>Redução e Falha:</strong> Imediatamente após terminar a última repetição da série padrão, você deve reduzir a carga para o peso indicado no Drop Set e, sem descansar, continuar a fazer o máximo de repetições que conseguir, até a falha muscular (quando não for mais possível realizar o movimento com a forma correta).</p></li></ol><p class=\"my-4\">No seu aplicativo, a série com Drop Set indicará a carga e as repetições da série padrão, e também a carga reduzida que você deve usar para as repetições até a falha.</p><p class=\"my-4\">Por que meu professor prescreveu um Drop Set?</p><p class=\"my-4\">Seu professor pode incluir essa técnica no seu treino para:</p><ul><li><p class=\"my-4\"><strong>Quebrar Platôs:</strong> Superar momentos em que seu progresso parece ter estagnado.</p></li><li><p class=\"my-4\"><strong>Aumentar a Hipertrofia:</strong> O alto volume e estresse no músculo são um grande estímulo para o crescimento muscular.</p></li><li><p class=\"my-4\"><strong>Intensificar o Treino:</strong> Aumentar a dificuldade e o desafio sem precisar adicionar muitos exercícios novos.</p></li></ul><p class=\"my-4\"><strong>Atenção:</strong> O Drop Set é uma técnica intensa. Execute-a apenas quando estiver indicado em seu treino e sempre priorize a boa forma para evitar lesões. Se tiver dúvidas, fale com seu professor!</p>","category":"Rotinas de Treino (Execução)","user_type":"ambos"}, 
 {"id":"861c9542-530b-46e3-a46c-8ac2506452f9","title":"Posso fazer os exercícios em uma ordem diferente?","content":"<p class=\"my-4\">Sim! Entendemos que a academia pode estar cheia e, às vezes, o equipamento que você precisa está ocupado. Por isso, a plataforma oferece total flexibilidade para você adaptar a ordem dos exercícios.</p><p class=\"my-4\"><strong>Como pular um exercício e voltar depois:</strong></p><ol><li><p class=\"my-4\">Se o equipamento do seu próximo exercício estiver ocupado, simplesmente <strong>role a tela para baixo</strong> até encontrar o exercício seguinte que você deseja fazer.</p></li><li><p class=\"my-4\">Execute todas as séries daquele exercício normalmente.</p></li><li><p class=\"my-4\">Quando terminar, você pode voltar para o exercício que pulou (se o equipamento estiver livre) ou continuar para o próximo da lista.</p></li></ol><p class=\"my-4\"><strong>O que é importante saber:</strong></p><ul><li><p class=\"my-4\"><strong>O progresso é salvo individualmente:</strong> Cada série que você finaliza é salva imediatamente. Você não perde nenhum dado ao pular para outro exercício.</p></li><li><p class=\"my-4\"><strong>A ordem não afeta o resultado final:</strong> No final da sessão, todos os exercícios que você completou serão registrados, independentemente da ordem em que foram feitos.</p></li><li><p class=\"my-4\"><strong>O cronômetro se adapta:</strong> O sistema sempre iniciará o cronômetro de descanso correto, seja entre séries do mesmo exercício ou o intervalo maior para o próximo exercício que você escolher.</p></li></ul><p class=\"my-4\">Essa flexibilidade garante que você possa completar seu treino da melhor forma possível, sem ficar parado esperando por um equipamento.</p><p class=\"my-4\"><br></p>","category":"Rotinas de Treino (Execução)","user_type":"ambos"}, 
 {"id":"06cfb6bb-191b-4c33-b870-e896d7585450","title":"Posso pular o tempo de descanso (intervalo)?","content":"<p class=\"my-4\"><strong>Sim, você pode!</strong></p><p class=\"my-4\">A plataforma foi projetada para ser flexível e se adaptar ao seu ritmo. Após finalizar uma série, o cronômetro de intervalo aparecerá na tela, mas você não precisa esperar até o final se não quiser.</p><p class=\"my-4\"><strong>Como pular o intervalo?</strong></p><p class=\"my-4\">Na tela do cronômetro de descanso, você verá um botão <strong>Pular&nbsp;</strong>ou um ícone para fechar. Ao clicar nele, o descanso é interrompido e você pode iniciar imediatamente a próxima série ou o próximo exercício.</p><p class=\"my-4\"><strong>Quando devo pular o intervalo?</strong></p><p class=\"my-4\">Embora a flexibilidade seja uma vantagem, é importante usar essa função com consciência. O tempo de descanso entre as séries e exercícios é uma variável crucial do treino, definida pelo seu professor com um propósito específico, como:</p><ul><li><p class=\"my-4\"><strong>Recuperação muscular:</strong> Garantir que você tenha força para a próxima série.</p></li><li><p class=\"my-4\"><strong>Estresse metabólico:</strong> Manter a intensidade alta para objetivos como hipertrofia ou queima de gordura.</p></li><li><p class=\"my-4\"><strong>Segurança:</strong> Evitar a fadiga excessiva que pode levar a lesões.</p></li></ul><p class=\"my-4\"><strong>Nossa recomendação:</strong></p><p class=\"my-4\">O ideal é <strong>sempre seguir o tempo de descanso prescrito pelo seu professor</strong>. Ele foi pensado para otimizar seus resultados e garantir sua segurança.</p><p class=\"my-4\">Use a função <strong>Pular</strong>&nbsp;apenas em situações específicas, como quando você está com pouco tempo para treinar ou se, após algumas semanas, você e seu professor perceberem que seu condicionamento permite intervalos mais curtos.</p>","category":"Rotinas de Treino (Execução)","user_type":"ambos"}, 
 {"id":"ecbe5eb3-621a-4d9a-9f34-dd074cb07c5d","title":"O que é o botão de Histórico?","content":"<p class=\"my-4\">Durante a execução de um treino, você encontrará um botão&nbsp;<strong>Histórico</strong>&nbsp;<img class=\"inline-block h-[1.2em] w-auto -translate-y-px\" src=\"data:image/svg+xml,%3Csvg%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%20width%3D%2232%22%20height%3D%2232%22%20viewBox%3D%220%200%2032%2032%22%3E%3Ccircle%20cx%3D%2216%22%20cy%3D%2216%22%20r%3D%2216%22%20fill%3D%22%23f3f4f6%22%2F%3E%3Cg%20transform%3D%22translate(4%2C%204)%22%20stroke%3D%22currentColor%22%20stroke-width%3D%222%22%20stroke-linecap%3D%22round%22%20stroke-linejoin%3D%22round%22%20fill%3D%22none%22%3E%3Cpath%20d%3D%22M3%2012a9%209%200%201%200%209-9%209.75%209.75%200%200%200-6.74%202.74L3%208%22%2F%3E%3Cpath%20d%3D%22M3%203v5h5%22%2F%3E%3C%2Fg%3E%3C%2Fsvg%3E\" alt=\"Ícone de Histórico\"> ao lado de cada exercício. A função deste botão é mostrar seu progresso de cargas e repetições para aquele exercício específico, mas <strong>apenas dentro da rotina de treino atual</strong>.</p><p class=\"my-4\"><strong>Por que não vejo o histórico de rotinas antigas?</strong></p><p class=\"my-4\">Essa é uma decisão de design para te ajudar a focar na sua progressão atual. Cada rotina de treino tem um objetivo diferente (hipertrofia, força, resistência, etc.) e, por isso, as cargas e repetições variam muito entre elas.</p><p class=\"my-4\">Misturar o histórico de uma rotina de \"resistência\" (altas repetições) com uma nova rotina de \"força\" (baixas repetições) poderia ser confuso e atrapalhar o seu planejamento de progressão de carga.</p><p class=\"my-4\">O histórico é projetado para te ajudar a aplicar o princípio da <strong>sobrecarga progressiva</strong> dentro do mesmo bloco de treino.</p><p class=\"my-4\"><strong>Nenhum histórico encontrado na primeira sessão. Isso é normal?</strong></p><p class=\"my-4\">Sim, é perfeitamente normal.</p><p class=\"my-4\">Ao iniciar a <strong>primeira sessão</strong> de uma nova rotina (por exemplo, o primeiro <strong>Treino A</strong>), o histórico para todos os exercícios estará vazio. Isso acontece porque você ainda não registrou nenhuma série <em>dentro desta nova rotina</em>.</p><p class=\"my-4\">Assim que você completar esta sessão e for executar o próximo <strong>Treino A</strong>&nbsp;(na semana seguinte, por exemplo), o histórico com os dados que você registrou na primeira sessão aparecerá, permitindo que você tente progredir a partir dali.</p>","category":"Rotinas de Treino (Execução)","user_type":"ambos"}, 
 {"id":"0db43104-2e7c-4245-ab9b-fd31597dda10","title":"Como ver os detalhes de um exercício durante o treino?","content":"<p class=\"my-4\"><strong>Esqueceu como se faz um exercício? Sem problemas!</strong></p><p class=\"my-4\">Sabemos que durante o treino podem surgir dúvidas sobre a execução correta de um movimento, qual equipamento usar ou qual a postura ideal. Para te ajudar a treinar com segurança e confiança, mesmo quando seu professor não está por perto, criamos a tela de <strong>Detalhes do Exercício</strong>.</p><p class=\"my-4\">É um guia rápido que você pode acessar a qualquer momento, diretamente da tela de execução do seu treino, sem interromper seu cronômetro ou perder seu progresso.</p><p class=\"my-4\"><strong>Como Acessar os Detalhes</strong></p><ol><li><p class=\"my-4\">Na tela de execução do treino, ao lado do nome de cada exercício, você encontrará um botão<strong> Informação</strong> <img class=\"inline-block h-[1.2em] w-auto -translate-y-px\" src=\"data:image/svg+xml,%3Csvg%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%20width%3D%2232%22%20height%3D%2232%22%20viewBox%3D%220%200%2032%2032%22%3E%3Ccircle%20cx%3D%2216%22%20cy%3D%2216%22%20r%3D%2216%22%20fill%3D%22%23f3f4f6%22%2F%3E%3Cg%20transform%3D%22translate(4%2C%204)%22%20stroke%3D%22currentColor%22%20stroke-width%3D%222%22%20stroke-linecap%3D%22round%22%20stroke-linejoin%3D%22round%22%20fill%3D%22none%22%3E%3Ccircle%20cx%3D%2212%22%20cy%3D%2212%22%20r%3D%2210%22%2F%3E%3Cpath%20d%3D%22M12%2016v-4%22%2F%3E%3Cpath%20d%3D%22M12%208h.01%22%2F%3E%3C%2Fg%3E%3C%2Fsvg%3E\" alt=\"Ícone de Informação\">, clique nele.</p></li><li><p class=\"my-4\">Uma tela (modal) se abrirá sobre seu treino, mostrando todas as informações que seu professor cadastrou para aquele exercício.</p></li></ol><p class=\"my-4\"><strong>O que você encontrará nesta tela?</strong></p><ul><li><p class=\"my-4\"><strong>Mídias Visuais:</strong> Fotos e vídeos que demonstram a forma correta de execução do início ao fim do movimento.</p></li><li><p class=\"my-4\"><strong>Instruções Passo a Passo:</strong> Um guia em texto com o passo a passo detalhado para realizar o exercício com a técnica correta.</p></li><li><p class=\"my-4\"><strong>Músculos Trabalhados:</strong> Informações sobre os grupos musculares primários e secundários que são ativados durante o exercício.</p></li><li><p class=\"my-4\"><strong>Dicas e Observações:</strong> Qualquer nota adicional que seu professor tenha deixado para te ajudar a ter o máximo de proveito do movimento.</p></li></ul><p class=\"my-4\">Para fechar a tela de detalhes e voltar ao seu treino, basta tocar no botão de fechar ou fora da área do modal. Seu treino estará exatamente onde você parou!</p>","category":"Rotinas de Treino (Execução)","user_type":"ambos"}, 
 {"id":"054ca40b-48c9-4145-aeed-b49f1a83a4f5","title":"O que acontece ao finalizar a última série do treino?","content":"<p class=\"my-4\">Para tornar sua experiência mais fluida e inteligente, a plataforma foi projetada para entender exatamente quando você concluiu seu treino.</p><p class=\"my-4\">Ao registrar a <strong>última série do último exercício</strong> da sua sessão, o sistema age da seguinte forma:</p><ol><li><p class=\"my-4\">A sessão de treino é <strong>automaticamente finalizada</strong> e marcada como <strong>Concluída.</strong></p></li><li><p class=\"my-4\">Todo o seu progresso é salvo no seu histórico.</p></li><li><p class=\"my-4\">Você é redirecionado para a tela anterior.</p></li></ol><p class=\"my-4\">Este comportamento foi pensado para sua conveniência, evitando que você precise clicar no botão <strong>Finalizar</strong> manualmente após seu último esforço. Diferente das outras séries, <strong>não haverá um cronômetro de intervalo</strong>, pois não há um próximo exercício para o qual descansar.</p>","category":"Rotinas de Treino (Execução)","user_type":"ambos"}, 
 {"id":"b4a1710c-b5cb-4eb7-8799-7297af2c4ed6","title":"O que acontece se eu finalizar um treino sem completar todos os exercícios?","content":"<p class=\"my-4\">Às vezes, imprevistos acontecem e você pode precisar encerrar seu treino antes de completar todos os exercícios. Não se preocupe! O botão <strong>Finalizar&nbsp;</strong>foi projetado para lidar com essa situação de forma inteligente, garantindo que seu esforço não seja perdido.</p><p class=\"my-4\"><strong>O que acontece quando você clica em Finalizar?</strong></p><p class=\"my-4\">Ao clicar em <strong>Finalizar</strong> antes de completar todas as séries e exercícios, o sistema fará o seguinte:</p><ol><li><p class=\"my-4\"><strong>Salva o Progresso Realizado:</strong> Todas as séries que você marcou como <strong>Finalizada</strong>&nbsp;serão salvas no seu histórico. Isso inclui as repetições, cargas e observações que você registrou.</p></li><li><p class=\"my-4\"><strong>Descarta o que Não Foi Feito:</strong> Qualquer exercício ou série que não foi iniciado ou finalizado será descartado. Eles <strong>não</strong> serão registrados como parte daquela sessão de treino.</p></li><li><p class=\"my-4\"><strong>Marca a Sessão como Concluída:</strong> A sessão de treino será considerada finalizada e aparecerá no seu histórico com o status <strong>Concluída</strong>.</p></li></ol><p class=\"my-4\"><strong>Por que isso é útil?</strong></p><p class=\"my-4\">Esse comportamento garante que seu histórico de treinos seja um reflexo fiel do que você realmente executou. Se você não teve tempo para fazer o último exercício ou se um aparelho estava ocupado, seu registro mostrará apenas o trabalho que você completou, mantendo seus dados de progresso precisos para você e seu professor.</p><p class=\"my-4\"><strong>Qual a diferença entre Pausar e Finalizar?</strong></p><ul><li><p class=\"my-4\"><strong>Pausar:</strong> Use esta opção quando você pretende <strong>voltar e continuar</strong> a mesma sessão de treino mais tarde. Seu progresso fica salvo e o cronômetro para.</p></li><li><p class=\"my-4\"><strong>Finalizar:</strong> Use esta opção quando você <strong>encerrou o treino</strong> daquele dia, mesmo que não tenha completado tudo. A sessão é fechada e o que não foi feito é descartado do registro.</p></li></ul><p class=\"my-4\"></p>","category":"Rotinas de Treino (Execução)","user_type":"ambos"}, 
 {"id":"2429e60f-40c1-49dd-a85d-87af3e71451a","title":"Terminei minha rotina de treino. E agora?","content":"<p class=\"my-4\">Parabéns por concluir sua rotina de treino! Completar todas as sessões é uma grande conquista e um passo importante na sua jornada.</p><p class=\"my-4\"><strong>O que acontece agora?</strong></p><p class=\"my-4\">Ao finalizar a última sessão, o status da sua rotina é alterado para <strong>Concluída</strong>. Seu professor é notificado, mas é uma ótima prática você também entrar em contato para alinhar os próximos passos.</p><p class=\"my-4\"><strong>Por que solicitar uma nova rotina?</strong></p><p class=\"my-4\">Seu corpo se adapta aos estímulos do treino. Para continuar evoluindo, seja para ganhar massa, emagrecer ou melhorar o condicionamento, é essencial introduzir novos exercícios, métodos e intensidades. Uma nova rotina garante que você continue progredindo e evita a estagnação (platô).</p><p class=\"my-4\"><strong>Como falar com seu professor?</strong></p><ol><li><p class=\"my-4\"><strong>Use o Chat do Aplicativo:</strong> A forma mais rápida e direta é enviar uma mensagem para seu professor através da nossa ferramenta de chat.</p></li><li><p class=\"my-4\"><strong>Pessoalmente:</strong> Se você tem contato direto com seu professor na academia, aproveite para conversar com ele no próximo encontro.</p></li></ol><p class=\"my-4\">Manter essa comunicação ativa é a chave para um acompanhamento de sucesso e para que seus resultados não parem de aparecer. Continue com o bom trabalho!</p>","category":"Rotinas de Treino (Execução)","user_type":"ambos"}, 
 {"id":"b2547a96-64be-49a1-a0be-da0adeff7a14","title":" Por que o aluno não pode criar sua própria rotina de treino?","content":"<p class=\"my-4\">Você já se perguntou por que a plataforma não permite que você, aluno, crie sua própria rotina de treinos do zero? Essa é uma decisão de design pensada para garantir sua <strong>segurança, progresso e os melhores resultados possíveis</strong>.</p><p class=\"my-4\">Nosso objetivo é conectar você a um profissional de educação física qualificado, que tem o conhecimento técnico para montar um plano de treino que seja não apenas eficaz, mas também seguro e perfeitamente alinhado aos seus objetivos.</p><p class=\"my-4\">Aqui estão os principais motivos:</p><p class=\"my-4\">1. Segurança e Prevenção de Lesões</p><p class=\"my-4\">Um profissional sabe como equilibrar os grupos musculares, definir o volume e a intensidade corretos e escolher exercícios que respeitem suas limitações. Criar um treino sem esse conhecimento pode levar a desequilíbrios musculares, sobrecarga e, consequentemente, a lesões que podem te afastar dos seus objetivos.</p><p class=\"my-4\">2. Periodização e Progressão Inteligente</p><p class=\"my-4\">Um bom treino não é apenas uma lista de exercícios. Ele faz parte de um planejamento maior chamado <strong>periodização</strong>. Seu professor organiza as fases do seu treinamento (por exemplo, adaptação, força, hipertrofia) e aplica o princípio da <strong>sobrecarga progressiva</strong> de forma controlada. Isso garante que seu corpo continue recebendo os estímulos certos para evoluir, evitando a estagnação (o famoso \"platô\").</p><p class=\"my-4\">3. Individualidade Biológica</p><p class=\"my-4\">Cada corpo é único. Um professor leva em conta sua experiência, histórico de lesões, disponibilidade de tempo, preferências e até mesmo sua biomecânica para montar o plano ideal para <strong>você</strong>. Um treino genérico ou montado sem essa análise profunda raramente trará os mesmos resultados.</p><p class=\"my-4\">4. Foco no que Importa: A Execução</p><p class=\"my-4\">Ao deixar o planejamento nas mãos de um especialista, você pode focar sua energia no que realmente importa para o resultado: <strong>executar cada série e cada repetição com a máxima qualidade e concentração</strong>. Deixe a ciência do treino com seu professor e concentre-se em dar o seu melhor na prática.</p><p class=\"my-4\">Conclusão</p><p class=\"my-4\">Acreditamos que a parceria entre um aluno dedicado e um profissional qualificado é a fórmula mais rápida e segura para o sucesso. Nossa plataforma foi construída para fortalecer essa parceria, dando ao seu professor as melhores ferramentas para te guiar e, a você, a confiança de estar no caminho certo.</p><p class=\"my-4\"><strong>Converse com seu professor, alinhe seus objetivos e confie no processo!</strong></p>","category":"Rotinas de Treino (Execução)","user_type":"ambos"}, 
 {"id":"7e9d244a-45be-40e9-99eb-8cafdd431d2c","title":"O que é o Sistema de Pontos?","content":"<p>O Sistema de Pontos é uma forma de acompanhar e recompensar sua dedicação aos treinos!</p>\n<p>Cada vez que você completa um treino, ganha pontos que contribuem para subir de nível. É uma maneira divertida de manter a motivação e visualizar seu progresso.</p>\n<p>No seu <strong>Painel Inicial</strong>, você encontra um card com seu nível atual, total de pontos e sequência de dias treinando.</p>","category":"Pontos e Conquistas","user_type":"ambos"}, 
 {"id":"09513f4a-2e9c-487a-92f4-36c64ccf5d31","title":"Como ganho pontos?","content":"<p>Você ganha pontos de várias formas:</p>\n<ul>\n<li><strong>Completar um treino:</strong> +50 pontos</li>\n<li><strong>Novo recorde pessoal:</strong> +30 pontos (maior sequência ou treino mais longo)</li>\n</ul>\n<p>Além disso, você pode ganhar <strong>bônus de sequência</strong> por treinar em dias consecutivos!</p>","category":"Pontos e Conquistas","user_type":"ambos"}, 
 {"id":"aabcccb7-ef89-4b96-a24a-b83bece65214","title":"O que é a Sequência (Streak)?","content":"<p>A <strong>Sequência</strong> (ou Streak) representa quantos dias seguidos você treinou.</p>\n<p>Quanto maior sua sequência, mais pontos bônus você ganha:</p>\n<ul>\n<li><strong>3 dias seguidos:</strong> +10 pontos</li>\n<li><strong>7 dias seguidos:</strong> +20 pontos</li>\n<li><strong>14 dias seguidos:</strong> +40 pontos</li>\n<li><strong>30 dias seguidos:</strong> +100 pontos</li>\n</ul>\n<p><strong>Atenção:</strong> Se você pular um dia de treino, sua sequência volta para zero! Mantenha a consistência para maximizar seus pontos.</p>","category":"Pontos e Conquistas","user_type":"ambos"}, 
 {"id":"50d621f7-45eb-48c2-a9f2-d1a563c8c366","title":"O que são os Níveis (Bronze, Prata, Ouro)?","content":"<p>Os níveis representam sua dedicação acumulada:</p>\n<ul>\n<li><strong>Bronze:</strong> 0 a 499 pontos</li>\n<li><strong>Prata:</strong> 500 a 1.499 pontos</li>\n<li><strong>Ouro:</strong> 1.500+ pontos</li>\n</ul>\n<p>Conforme você acumula pontos, sobe automaticamente de nível. É uma forma de mostrar sua evolução!</p>","category":"Pontos e Conquistas","user_type":"ambos"}, 
 {"id":"46e0e596-208f-4e9e-a2d3-a3c40f5d1774","title":"Onde vejo meus pontos e progresso?","content":"<p>Você pode acompanhar seu progresso em dois lugares:</p>\n<ul>\n<li><strong>Painel Inicial:</strong> O card colorido mostra seu nível, pontos totais e sequência atual</li>\n<li><strong>Página Como Funciona:</strong> Clicando no card de pontos, você acessa uma página com todas as regras detalhadas</li>\n</ul>\n<p>Ao finalizar cada treino, uma tela de celebração mostra os pontos ganhos naquela sessão!</p>","category":"Pontos e Conquistas","user_type":"ambos"}, 
 {"id":"6ef17b5a-82bd-4593-89be-8fe48f41669b","title":"O que acontece quando finalizo um treino?","content":"<p>Ao finalizar um treino, você verá uma <strong>tela de celebração</strong> com:</p>\n<ul>\n<li>Duração do treino em minutos</li>\n<li>Sua sequência atual de dias</li>\n<li>Pontos ganhos (treino + bônus de sequência)</li>\n<li>Seu nível atual e progresso para o próximo</li>\n<li>Aviso se você bateu algum recorde pessoal!</li>\n</ul>\n<p>É o momento de comemorar sua dedicação!</p>","category":"Pontos e Conquistas","user_type":"ambos"}, 
 {"id":"5f647922-6a98-42b7-844f-792d825e6f1e","title":"O que são as Avaliações Físicas?","content":"<p class=\"my-4\">A Avaliação Física é uma ferramenta essencial para medir e acompanhar a evolução física. Durante uma avaliação, são registradas medidas corporais (como peso, altura e circunferências) e fotos de progresso (frente, costas e lado).</p><p class=\"my-4\">Com base nesses dados, a plataforma calcula automaticamente o IMC (Índice de Massa Corporal) e realiza uma análise de simetria corporal. Essas informações fornecem insights valiosos para a criação e o ajuste do plano de treino, garantindo que ele esteja sempre alinhado aos objetivos definidos.</p>","category":"Avaliações Físicas","user_type":"ambos"}, 
 {"id":"6f687358-8de2-425e-9798-bc7913d8b6c9","title":"Como acesso as avaliações dos meus alunos?","content":"<p class=\"my-4\"><strong>1. Pela página \"Avaliações\" (Visão Geral)</strong></p><p class=\"my-4\">Este é o melhor caminho para ter uma visão completa de todos os seus alunos que já possuem avaliações.</p><ul><li><p class=\"my-4\">No menu principal, acesse <strong>Avaliações</strong>.</p></li><li><p class=\"my-4\">Você verá uma lista de todos os seus alunos com seus respectivos históricos de avaliações.</p></li><li><p class=\"my-4\">Para criar uma nova avaliação para qualquer aluno, clique no botão de adicionar <img class=\"inline-block h-[1.2em] w-auto -translate-y-px\" src=\"data:image/svg+xml,%3Csvg%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%20width%3D%2232%22%20height%3D%2232%22%20viewBox%3D%220%200%2032%2032%22%3E%3Ccircle%20cx%3D%2216%22%20cy%3D%2216%22%20r%3D%2216%22%20fill%3D%22%23f3f4f6%22%2F%3E%3Cg%20transform%3D%22translate(4%2C%204)%22%20stroke%3D%22currentColor%22%20stroke-width%3D%222%22%20stroke-linecap%3D%22round%22%20stroke-linejoin%3D%22round%22%20fill%3D%22none%22%3E%3Cpath%20d%3D%22M5%2012h14%22%2F%3E%3Cpath%20d%3D%22M12%205v14%22%2F%3E%3C%2Fg%3E%3C%2Fsvg%3E\" alt=\"Ícone de Adicionar\"><code>&nbsp;</code>no canto inferior direito. Uma janela se abrirá para você selecionar o aluno.</p></li></ul><p class=\"my-4\"><strong>2. Pela página \"Alunos\" (Foco em um Aluno Específico)</strong></p><p class=\"my-4\">Use este caminho quando quiser focar em um único aluno.</p><ul><li><p class=\"my-4\">No menu principal, acesse <strong>Alunos</strong>.</p></li><li><p class=\"my-4\">No card do aluno desejado, clique no botão de opções <img class=\"inline-block h-[1.2em] w-auto -translate-y-px\" src=\"data:image/svg+xml,%3Csvg%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%20width%3D%2232%22%20height%3D%2232%22%20viewBox%3D%220%200%2032%2032%22%3E%3Ccircle%20cx%3D%2216%22%20cy%3D%2216%22%20r%3D%2216%22%20fill%3D%22%23f3f4f6%22%2F%3E%3Cg%20transform%3D%22translate(4%2C%204)%22%20stroke%3D%22currentColor%22%20stroke-width%3D%222%22%20stroke-linecap%3D%22round%22%20stroke-linejoin%3D%22round%22%20fill%3D%22none%22%3E%3Ccircle%20cx%3D%2212%22%20cy%3D%2212%22%20r%3D%221%22%2F%3E%3Ccircle%20cx%3D%2212%22%20cy%3D%225%22%20r%3D%221%22%2F%3E%3Ccircle%20cx%3D%2212%22%20cy%3D%2219%22%20r%3D%221%22%2F%3E%3C%2Fg%3E%3C%2Fsvg%3E\" alt=\"Ícone de Menu\">&nbsp;e selecione <strong>Avaliações</strong>.</p></li><li><p class=\"my-4\">Você será levado diretamente para o painel de avaliações daquele aluno, onde pode criar uma nova avaliação clicando no botão <img class=\"inline-block h-[1.2em] w-auto -translate-y-px\" src=\"data:image/svg+xml,%3Csvg%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%20width%3D%2232%22%20height%3D%2232%22%20viewBox%3D%220%200%2032%2032%22%3E%3Ccircle%20cx%3D%2216%22%20cy%3D%2216%22%20r%3D%2216%22%20fill%3D%22%23f3f4f6%22%2F%3E%3Cg%20transform%3D%22translate(4%2C%204)%22%20stroke%3D%22currentColor%22%20stroke-width%3D%222%22%20stroke-linecap%3D%22round%22%20stroke-linejoin%3D%22round%22%20fill%3D%22none%22%3E%3Cpath%20d%3D%22M5%2012h14%22%2F%3E%3Cpath%20d%3D%22M12%205v14%22%2F%3E%3C%2Fg%3E%3C%2Fsvg%3E\" alt=\"Ícone de Adicionar\">.</p></li></ul><p class=\"my-4\"></p>","category":"Avaliações Físicas","user_type":"professor"}, 
 {"id":"c5b853c2-ffcd-40b3-955c-521330119b6a","title":"Como vejo minhas avaliações e meu progresso?","content":"<p class=\"my-4\">A página <strong>Avaliações</strong> é o seu painel central para acompanhar toda a sua evolução física. Ela é organizada em três abas principais para facilitar a visualização:</p><p class=\"my-4\"><strong>1. Histórico</strong></p><p class=\"my-4\">Nesta aba, você encontra uma lista de todas as avaliações que seu professor já realizou, organizadas da mais recente para a mais antiga.</p><ul><li><p class=\"my-4\">Para ver todos os detalhes de uma avaliação específica — incluindo medidas, fotos e a análise de simetria — basta clicar no botão de opções&nbsp;<img class=\"inline-block h-[1.2em] w-auto -translate-y-px\" src=\"data:image/svg+xml,%3Csvg%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%20width%3D%2232%22%20height%3D%2232%22%20viewBox%3D%220%200%2032%2032%22%3E%3Ccircle%20cx%3D%2216%22%20cy%3D%2216%22%20r%3D%2216%22%20fill%3D%22%23f3f4f6%22%2F%3E%3Cg%20transform%3D%22translate(4%2C%204)%22%20stroke%3D%22currentColor%22%20stroke-width%3D%222%22%20stroke-linecap%3D%22round%22%20stroke-linejoin%3D%22round%22%20fill%3D%22none%22%3E%3Ccircle%20cx%3D%2212%22%20cy%3D%2212%22%20r%3D%221%22%2F%3E%3Ccircle%20cx%3D%2212%22%20cy%3D%225%22%20r%3D%221%22%2F%3E%3Ccircle%20cx%3D%2212%22%20cy%3D%2219%22%20r%3D%221%22%2F%3E%3C%2Fg%3E%3C%2Fsvg%3E\" alt=\"Ícone de Menu\">&nbsp;e selecionar&nbsp;<strong>Detalhes</strong>.</p></li></ul><ol start=\"2\"><li><p class=\"my-4\"><strong>Gráficos</strong></p></li></ol><p class=\"my-4\">Visualize seu progresso de forma quantitativa com gráficos interativos.</p><ul><li><p class=\"my-4\">Acompanhe a evolução do seu peso, IMC e de todas as suas medidas corporais ao longo do tempo.</p></li><li><p class=\"my-4\">Você pode selecionar um <strong>período de análise</strong> específico e escolher quais medidas quer exibir no gráfico para uma visualização mais limpa.</p></li></ul><p class=\"my-4\"><strong>3. Antes X Depois</strong></p><p class=\"my-4\">Acompanhe sua transformação de forma visual e motivadora.</p><ul><li><p class=\"my-4\">Use a ferramenta de comparação <strong>Antes X Depois</strong>&nbsp;para colocar as fotos de diferentes avaliações lado a lado.</p></li><li><p class=\"my-4\">Você pode selecionar qualquer avaliação anterior como o seu <strong>Antes</strong>&nbsp;para comparar com a sua avaliação mais recente.</p></li></ul><p class=\"my-4\">Use essas ferramentas para celebrar suas conquistas e se manter motivado(a) em sua jornada!</p>","category":"Avaliações Físicas","user_type":"aluno"}, 
 {"id":"47036373-6b9d-4bae-93c1-7b0485fecf21","title":"Quais informações temos em avaliações?","content":"<p class=\"my-4\">Em avaliações você terá acesso a um painel completo com as abas:</p><ul><li><p class=\"my-4\"><strong>Histórico:</strong> Acompanhe todas as avaliações já realizadas em ordem cronológica. Você pode ver detalhes, editar ou excluir avaliações existentes através do menu de opções de cada uma.</p></li><li><p class=\"my-4\"><strong>Gráficos:</strong> Para alunos com pelo menos duas avaliações, visualize o progresso de cada medida corporal em gráficos de linha interativos.</p></li><li><p class=\"my-4\"><strong>Antes X Depois:</strong> Compare o <strong>Antes e Depois</strong>&nbsp;com as fotos de diferentes avaliações, uma ferramenta visual poderosa para motivar seu aluno.</p></li></ul><p class=\"my-4\">Além disso, a plataforma oferece uma <strong>análise de simetria</strong> automática para te ajudar a identificar desequilíbrios musculares e ajustar os treinos com mais precisão.</p>","category":"Avaliações Físicas","user_type":"ambos"}, 
 {"id":"8d12a033-adf8-4d33-a2f9-c62861919a51","title":"Em avaliações como posso ver a evolução do aluno?","content":"<p class=\"my-4\">O verdadeiro poder das avaliações físicas se revela quando você realiza mais de um registro para um aluno. A plataforma utiliza esses dados para gerar visualizações claras do progresso em duas abas principais: <strong>Gráficos&nbsp;</strong>e <strong>Antes X Depois</strong>.</p><p class=\"my-4\">Essas ferramentas são essenciais para analisar tendências, ajustar o plano de treino e, principalmente, motivar seu aluno com provas concretas da evolução dele.</p><hr><p class=\"my-4\"><strong>Gráficos</strong></p><p class=\"my-4\">Nesta aba, você pode visualizar o progresso de cada medida corporal em gráficos de linha interativos. É a maneira perfeita de analisar tendências e ver a evolução dos resultados de forma quantitativa.</p><ul><li><p class=\"my-4\"><strong>Analisando um Período Específico:</strong> Por padrão, o gráfico exibe a evolução desde a primeira avaliação até a mais recente. Você pode personalizar o período de análise selecionando uma <strong>Data Inicial</strong> diferente no seletor. Isso permite focar em fases específicas do treino.</p></li><li><p class=\"my-4\"><strong>Filtro de Medidas:</strong> Para uma análise mais limpa, você pode escolher quais linhas (medidas) exibir no gráfico. Basta clicar nos '<code>badges'&nbsp;</code>coloridos (ex: <strong>Peso</strong>, <strong>Cintura</strong>, <strong>Braço D</strong>.) para mostrar ou ocultar as linhas correspondentes.</p></li><li><p class=\"my-4\"><strong>Resumo da Evolução:</strong> Acima de cada gráfico, um resumo mostra a <strong>diferença total</strong> (ganho ou perda) para cada medida selecionada dentro do período de análise, facilitando a visualização do resultado consolidado.</p></li></ul><hr><p class=\"my-4\"><strong>Antes X Depois</strong></p><p class=\"my-4\">Utilize a ferramenta de comparação <strong>Antes X Depois</strong> para colocar as fotos de diferentes avaliações lado a lado. Este recurso é extremamente motivador e oferece uma prova visual clara da transformação física do aluno.</p><ul><li><p class=\"my-4\"><strong>Selecionando a Foto do Antes:</strong> A foto do <strong>Depois</strong> é sempre a da avaliação mais recente. Você tem total controle sobre a foto do <strong>Antes</strong>: basta usar o seletor de data para escolher qualquer uma das avaliações anteriores do aluno.</p></li></ul><p class=\"my-4\">Isso permite criar comparações flexíveis, como \"início do ano vs. agora\" ou \"início do plano vs. meio do plano\", tornando a ferramenta ainda mais poderosa para celebrar as conquistas.</p><hr><p class=\"my-4\">Essas ferramentas de evolução permitem que tanto professores como seus alunos acompanhem o progresso de forma detalhada e motivadora, celebrando cada conquista ao longo da jornada.</p>","category":"Avaliações Físicas","user_type":"ambos"}, 
 {"id":"eb276a77-af2e-4b5a-859f-d816ef5081ad","title":"Qual o intervalo ideal entre Avaliações Físicas?","content":"<p class=\"my-4\">A Avaliação Física é uma ferramenta essencial para registrar o progresso e ajustar os planos de treino. Para que os dados sejam significativos, é importante realizá-la nos momentos certos. Aqui estão algumas recomendações:</p><p class=\"my-4\"><strong>1. Respeite o Intervalo Mínimo de 30 Dias</strong></p><p class=\"my-4\">Recomendamos um intervalo de pelo menos 30 dias entre uma avaliação e outra. O motivo é simples:</p><ul><li><p class=\"my-4\"><strong>Resultados Visíveis:</strong> Mudanças corporais significativas, como ganho de massa muscular ou perda de gordura, levam tempo para acontecer. Avaliações muito próximas podem não mostrar um progresso claro, o que pode ser desmotivador.</p></li><li><p class=\"my-4\"><strong>Dados Mais Precisos:</strong> Um intervalo maior permite uma análise mais precisa da evolução, ajudando a entender o que está funcionando no plano de treino.</p></li></ul><p class=\"my-4\">A plataforma irá avisar o professor se uma nova avaliação for criada em menos de 30 dias, mas permitirá a continuação caso seja uma necessidade específica alinhada com o aluno.</p><p class=\"my-4\"><strong>2. Antes de Iniciar uma Nova Rotina de Treino</strong></p><p class=\"my-4\">É uma excelente prática realizar uma avaliação física antes de começar uma nova rotina. Isso serve como um \"ponto de partida\" claro, permitindo que o professor:</p><ul><li><p class=\"my-4\"><strong>Personalize o Novo Treino:</strong> Ajuste os exercícios e a intensidade da nova rotina com base na condição física atual do aluno.</p></li><li><p class=\"my-4\"><strong>Meça a Eficácia:</strong> Ao final da nova rotina, uma outra avaliação mostrará exatamente o impacto que o novo plano teve nos resultados.</p></li></ul><p class=\"my-4\">Estas são recomendações gerais. A frequência ideal pode variar de acordo com os objetivos, nível de treinamento e estratégia do professor. </p>","category":"Avaliações Físicas","user_type":"ambos"}, 
 {"id":"84513ff2-d1f4-4c2d-b97c-5ef305c2ca2e","title":"Como criar uma nova Avaliação Física para o aluno?","content":"<p class=\"my-4\">A Avaliação Física é uma das ferramentas mais importantes da plataforma, permitindo que você registre e acompanhe a evolução corporal dos seus alunos de forma detalhada.</p><p class=\"my-4\">Você pode iniciar a criação de uma nova avaliação de duas maneiras:</p><ul><li><p class=\"my-4\"><strong>Pela página Avaliações:</strong> No menu principal, acesse <strong>Avaliações</strong>. Clique no botão de adicionar <img class=\"inline-block h-[1.2em] w-auto -translate-y-px\" src=\"data:image/svg+xml,%3Csvg%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%20width%3D%2232%22%20height%3D%2232%22%20viewBox%3D%220%200%2032%2032%22%3E%3Ccircle%20cx%3D%2216%22%20cy%3D%2216%22%20r%3D%2216%22%20fill%3D%22%23f3f4f6%22%2F%3E%3Cg%20transform%3D%22translate(4%2C%204)%22%20stroke%3D%22currentColor%22%20stroke-width%3D%222%22%20stroke-linecap%3D%22round%22%20stroke-linejoin%3D%22round%22%20fill%3D%22none%22%3E%3Cpath%20d%3D%22M5%2012h14%22%2F%3E%3Cpath%20d%3D%22M12%205v14%22%2F%3E%3C%2Fg%3E%3C%2Fsvg%3E\" alt=\"Ícone de Adicionar\"><code>&nbsp;</code>no canto inferior direito e selecione para qual aluno a nova avaliação será criada.</p></li><li><p class=\"my-4\"><strong>Pela página de um aluno:</strong> Acesse a página <strong>Alunos</strong>, encontre o aluno desejado e, no menu de opções <img class=\"inline-block h-[1.2em] w-auto -translate-y-px\" src=\"data:image/svg+xml,%3Csvg%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%20width%3D%2232%22%20height%3D%2232%22%20viewBox%3D%220%200%2032%2032%22%3E%3Ccircle%20cx%3D%2216%22%20cy%3D%2216%22%20r%3D%2216%22%20fill%3D%22%23f3f4f6%22%2F%3E%3Cg%20transform%3D%22translate(4%2C%204)%22%20stroke%3D%22currentColor%22%20stroke-width%3D%222%22%20stroke-linecap%3D%22round%22%20stroke-linejoin%3D%22round%22%20fill%3D%22none%22%3E%3Ccircle%20cx%3D%2212%22%20cy%3D%2212%22%20r%3D%221%22%2F%3E%3Ccircle%20cx%3D%2212%22%20cy%3D%225%22%20r%3D%221%22%2F%3E%3Ccircle%20cx%3D%2212%22%20cy%3D%2219%22%20r%3D%221%22%2F%3E%3C%2Fg%3E%3C%2Fsvg%3E\" alt=\"Ícone de Menu\">, selecione <strong>Avaliações</strong>. Na página de histórico do aluno, clique no botão de adicionar <img class=\"inline-block h-[1.2em] w-auto -translate-y-px\" src=\"data:image/svg+xml,%3Csvg%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%20width%3D%2232%22%20height%3D%2232%22%20viewBox%3D%220%200%2032%2032%22%3E%3Ccircle%20cx%3D%2216%22%20cy%3D%2216%22%20r%3D%2216%22%20fill%3D%22%23f3f4f6%22%2F%3E%3Cg%20transform%3D%22translate(4%2C%204)%22%20stroke%3D%22currentColor%22%20stroke-width%3D%222%22%20stroke-linecap%3D%22round%22%20stroke-linejoin%3D%22round%22%20fill%3D%22none%22%3E%3Cpath%20d%3D%22M5%2012h14%22%2F%3E%3Cpath%20d%3D%22M12%205v14%22%2F%3E%3C%2Fg%3E%3C%2Fsvg%3E\" alt=\"Ícone de Adicionar\">.</p></li></ul><p class=\"my-4\">Ambos os caminhos te levarão ao formulário de criação, que é dividido em seções para facilitar o preenchimento.</p><hr><p class=\"my-4\">Detalhes dos Campos</p><p class=\"my-4\"><strong>1. Dados Básicos (Obrigatório)</strong></p><p class=\"my-4\">Estes são os campos essenciais para o cálculo do IMC (Índice de Massa Corporal).</p><ul><li><p class=\"my-4\"><strong>Peso (kg):</strong> Insira o peso atual do aluno.</p></li><li><p class=\"my-4\"><strong>Altura (cm):</strong> Insira a altura do aluno em centímetros.</p></li></ul><p class=\"my-4\"><strong>2. Medidas Corporais (Obrigatório)</strong></p><p class=\"my-4\">Todas as medidas de circunferência são obrigatórias para garantir uma análise de simetria corporal precisa. A plataforma calcula automaticamente as diferenças entre os lados direito e esquerdo.</p><ul><li><p class=\"my-4\"><strong>Tronco:</strong> Peito/Busto, Cintura e Quadril.</p></li><li><p class=\"my-4\"><strong>Membros Superiores:</strong> Braço Direito, Braço Esquerdo, Antebraço Direito e Antebraço Esquerdo.</p></li><li><p class=\"my-4\"><strong>Membros Inferiores:</strong> Coxa Direita, Coxa Esquerda, Panturrilha Direita e Panturrilha Esquerda.</p></li></ul><p class=\"my-4\"><strong>3. Fotos (Obrigatório)</strong></p><p class=\"my-4\">Esta seção é fundamental para um acompanhamento visual poderoso do progresso do aluno. <strong>As três fotos são obrigatórias para salvar a avaliação.</strong></p><ul><li><p class=\"my-4\"><strong>Foto de Frente, Lado e Costas:</strong> Você pode tirar uma foto na hora (no celular) ou selecionar uma imagem do seu dispositivo. As imagens são otimizadas automaticamente para não ocupar muito espaço.</p></li></ul><p class=\"my-4\"><strong>4. Observações (Opcional)</strong></p><p class=\"my-4\">Use este campo para registrar informações qualitativas importantes.</p><ul><li><p class=\"my-4\"><strong>Observações:</strong> Anote detalhes sobre a avaliação, objetivos específicos do aluno, pontos de atenção, feedback da última rotina, ou qualquer outra informação que julgar relevante.</p></li></ul><hr><p class=\"my-4\">Após preencher os campos, clique no botão salvar avaliação<strong>&nbsp;</strong><img class=\"inline-block h-[1.2em] w-auto -translate-y-px\" src=\"data:image/svg+xml,%3Csvg%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%20width%3D%2232%22%20height%3D%2232%22%20viewBox%3D%220%200%2032%2032%22%3E%3Ccircle%20cx%3D%2216%22%20cy%3D%2216%22%20r%3D%2216%22%20fill%3D%22%23f3f4f6%22%2F%3E%3Cg%20transform%3D%22translate(4%2C%204)%22%20stroke%3D%22currentColor%22%20stroke-width%3D%222%22%20stroke-linecap%3D%22round%22%20stroke-linejoin%3D%22round%22%20fill%3D%22none%22%3E%3Cpath%20d%3D%22M19%2021H5a2%202%200%200%201-2-2V5a2%202%200%200%201%202-2h11l5%205v11a2%202%200%200%201-2%202z%22%20%2F%3E%3Cpolyline%20points%3D%2217%2021%2017%2013%207%2013%207%2021%22%20%2F%3E%3Cpolyline%20points%3D%227%203%207%208%2015%208%22%20%2F%3E%3C%2Fg%3E%3C%2Fsvg%3E\" alt=\"Ícone de Salvar\"><strong>,</strong><code>&nbsp;</code>para registrar os dados. A nova avaliação aparecerá no histórico do aluno, e os dados serão usados para gerar gráficos de evolução e análises comparativas.</p>","category":"Avaliações Físicas","user_type":"professor"}, 
 {"id":"7417524a-d940-42dd-9695-6213b8a136ee","title":"As fotos das avaliações são armazenadas de forma segura?","content":"<p class=\"my-4\">Sim, a segurança das suas fotos é nossa prioridade. Todas as imagens de avaliação são armazenadas em um local seguro e privado, inacessível publicamente. Apenas o aluno e o professor responsável pela sua rotina ativa podem visualizá-las através de links temporários e seguros gerados pela plataforma.</p>","category":"Avaliações Físicas","user_type":"ambos"}, 
 {"id":"06dc4ff9-58ac-4276-aa2b-4cd923a568f4","title":"O Titans é gratuito para professores?","content":"<p class=\"my-4\"><strong>Sim, o Titans é e sempre será gratuito para professores!</strong></p><p class=\"my-4\">Você pode usar todas as funcionalidades da plataforma sem nenhum custo:</p><ul class=\"list-disc pl-6 my-4\"><li>Cadastrar e gerenciar seus alunos</li><li>Criar rotinas de treino personalizadas</li><li>Acompanhar a execução e evolução dos alunos</li><li>Realizar avaliações físicas</li><li>Comunicar-se com seus alunos pelo chat</li><li>E muito mais!</li></ul><p class=\"my-4\"><strong>Por que é gratuito?</strong></p><p class=\"my-4\">Acreditamos que os melhores profissionais de educação física merecem ferramentas de qualidade para potencializar seu trabalho. Nossa missão é ajudar você a entregar mais valor aos seus alunos.</p><p class=\"my-4\">No futuro, ofereceremos uma versão corporativa para academias com funcionalidades adicionais de gestão. Mas isso não afetará sua conta de professor - ela continuará gratuita.</p>","category":"Termos e Privacidade","user_type":"professor"}, 
 {"id":"818ccfd8-a3ed-4b20-a379-f404cf553288","title":"Como o Titans.fitness usa meus dados?","content":"Usamos seus dados exclusivamente para o funcionamento da plataforma: personalizar sua experiência, permitir a comunicação com seu professor/aluno, analisar o uso para melhorias e garantir a segurança. Dados de treino podem ser usados de forma **anonimizada** para alimentar nossos sistemas de inteligência artificial, com o objetivo de oferecer insights e aprimorar o serviço.","category":"Termos e Privacidade","user_type":"ambos"}, 
 {"id":"d703585c-bcac-4fed-92c7-cb0a724ae93c","title":"Meus dados são compartilhados com alguém?","content":"Seus dados **não são vendidos**. O compartilhamento ocorre apenas de forma funcional:\\n1.  **Entre você e seu professor/aluno:** Para que o serviço de consultoria funcione.\\n2.  **Com provedores de serviço:** Empresas que nos ajudam a manter a plataforma no ar (ex: servidores de nuvem), sob estritos contratos de confidencialidade.\\n3.  **Por obrigação legal:** Se formos obrigados por lei ou ordem judicial.","category":"Termos e Privacidade","user_type":"ambos"}, 
 {"id":"2732c19b-f201-4fa2-a1cf-f81c6f600972","title":"O que acontece com meus dados se minha conta for excluída?","content":"Após a exclusão de uma conta, seja por inatividade ou por solicitação do usuário, todos os dados pessoais associados (perfil, treinos, histórico, avaliações) são **permanentemente removidos** de nossos sistemas e não podem ser recuperados.","category":"Termos e Privacidade","user_type":"ambos"}, 
 {"id":"e3ae57d6-9244-4ae2-8bf4-a54bd7c36023","title":"Quais são minhas responsabilidades como Aluno?","content":"Como Aluno, sua responsabilidade é fornecer informações de saúde precisas ao seu professor, seguir as orientações de treino de forma segura e comunicar qualquer dor ou desconforto. Lembre-se de respeitar seus limites e usar a plataforma de forma adequada.","category":"Termos e Privacidade","user_type":"aluno"}, 
 {"id":"1173eff0-116c-4438-a0aa-6001ad459df9","title":"Quais são minhas responsabilidades como Professor na plataforma?","content":"Como Professor, você é responsável por possuir as qualificações necessárias para prescrever treinos, criar programas seguros e adequados para seus alunos, e manter a confidencialidade das informações deles. O Titans.fitness é uma ferramenta para facilitar seu trabalho, mas a responsabilidade profissional sobre o serviço prestado é sua.","category":"Termos e Privacidade","user_type":"professor"}, 
 {"id":"676deb13-8014-4325-ade9-950298f3fff4","title":"Qual é a política de exclusão de contas por inatividade?","content":"Para manter nossa plataforma otimizada, contas de **Alunos e Professores** que permanecerem inativas por **90 (noventa) dias consecutivos** são programadas para exclusão automática. Um e-mail de aviso é enviado aos 60 dias de inatividade. Para evitar a exclusão, basta fazer login na plataforma.","category":"Termos e Privacidade","user_type":"ambos"}]